{
    "champid": "deadpool",
    "data": {
        "2+1": {
            "rank": 1,
            "prestige": "244",
            "hp": "1012",
            "attack": "85",
            "crit_rate": "478",
            "crit_dmge": "563",
            "armor": "33",
            "block_prof": "2845",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 242.88 to 1213.85 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/2",
            "champid": "deadpool+2+1",
            "challenger_rating": 20,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 384.56 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 212.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 246.5 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "2+2": {
            "rank": 2,
            "prestige": "320",
            "hp": "1341",
            "attack": "112",
            "crit_rate": "493",
            "crit_dmge": "580",
            "armor": "52",
            "block_prof": "2934",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 321.84 to 1608.48 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/2",
            "champid": "deadpool+2+2",
            "challenger_rating": 30,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 509.58 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 280 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 324.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "2+3": {
            "rank": 3,
            "prestige": "529",
            "hp": "2134",
            "attack": "178",
            "crit_rate": "508",
            "crit_dmge": "598",
            "armor": "71",
            "block_prof": "3023",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 512.16 to 2559.65 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/2",
            "champid": "deadpool+2+3",
            "challenger_rating": 40,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 810.92 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 445 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 516.2 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "3+1": {
            "rank": 1,
            "prestige": "459",
            "hp": "1841",
            "attack": "154",
            "crit_rate": "508",
            "crit_dmge": "598",
            "armor": "71",
            "block_prof": "3023",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 441.84 to 2208.21 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/3",
            "champid": "deadpool+3+1",
            "challenger_rating": 40,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 699.58 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 385 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 446.6 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "3+2": {
            "rank": 2,
            "prestige": "731",
            "hp": "2951",
            "attack": "246",
            "crit_rate": "523",
            "crit_dmge": "615",
            "armor": "93",
            "block_prof": "3112",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 708.24 to 3539.61 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/3",
            "champid": "deadpool+3+2",
            "challenger_rating": 50,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 1121.38 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 615 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 713.4 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "3+3": {
            "rank": 3,
            "prestige": "1023",
            "hp": "4142",
            "attack": "344",
            "crit_rate": "538",
            "crit_dmge": "633",
            "armor": "115",
            "block_prof": "3200",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 994.08 to 4968.17 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/3",
            "champid": "deadpool+3+3",
            "challenger_rating": 60,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 1573.96 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 860 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 997.6 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "3+4": {
            "rank": 4,
            "prestige": "1403",
            "hp": "5687",
            "attack": "472",
            "crit_rate": "553",
            "crit_dmge": "650",
            "armor": "140",
            "block_prof": "3289",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 1364.88 to 6821.33 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/3",
            "champid": "deadpool+3+4",
            "challenger_rating": 70,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 2161.06 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 1180 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 1368.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "4+1": {
            "rank": 1,
            "prestige": "999",
            "hp": "3971",
            "attack": "343",
            "crit_rate": "538",
            "crit_dmge": "633",
            "armor": "157",
            "block_prof": "3200",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 953.04 to 4763.06 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/4",
            "champid": "deadpool+4+1",
            "challenger_rating": 60,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 1508.98 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 857.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 994.7 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "4+2": {
            "rank": 2,
            "prestige": "1405",
            "hp": "5570",
            "attack": "481",
            "crit_rate": "553",
            "crit_dmge": "650",
            "armor": "183",
            "block_prof": "3289",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 1336.8 to 6681 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/4",
            "champid": "deadpool+4+2",
            "challenger_rating": 70,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 2116.6 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 1202.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 1394.9 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "4+3": {
            "rank": 3,
            "prestige": "1967",
            "hp": "7805",
            "attack": "674",
            "crit_rate": "568",
            "crit_dmge": "668",
            "armor": "212",
            "block_prof": "3378",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 1873.2 to 9361.79 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/4",
            "champid": "deadpool+4+3",
            "challenger_rating": 80,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 2965.9 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 1685 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 1954.6 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "4+4": {
            "rank": 4,
            "prestige": "2590",
            "hp": "10255",
            "attack": "886",
            "crit_rate": "583",
            "crit_dmge": "686",
            "armor": "242",
            "block_prof": "3467",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 2461.2 to 12300.47 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/4",
            "champid": "deadpool+4+4",
            "challenger_rating": 90,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 3896.9 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 2215 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 2569.4 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "4+5": {
            "rank": 5,
            "prestige": "3455",
            "hp": "13683",
            "attack": "1182",
            "crit_rate": "598",
            "crit_dmge": "703",
            "armor": "273",
            "block_prof": "3556",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 3283.92 to 16412.23 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/4",
            "champid": "deadpool+4+5",
            "challenger_rating": 100,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 5199.54 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 2955 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 3427.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "5+1": {
            "rank": 1,
            "prestige": "2067",
            "hp": "8166",
            "attack": "705",
            "crit_rate": "568",
            "crit_dmge": "668",
            "armor": "362",
            "block_prof": "3378",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 3109.45 to 14701.7 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/5",
            "champid": "deadpool+5+1",
            "challenger_rating": 80,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 3103.08 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 1762.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 2044.5 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "5+2": {
            "rank": 2,
            "prestige": "2729",
            "hp": "10787",
            "attack": "932",
            "crit_rate": "583",
            "crit_dmge": "686",
            "armor": "400",
            "block_prof": "3467",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 4107.47 to 19420.43 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/5",
            "champid": "deadpool+5+2",
            "challenger_rating": 90,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 4099.06 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 2330 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 2702.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "5+3": {
            "rank": 3,
            "prestige": "3821",
            "hp": "15080",
            "attack": "1302",
            "crit_rate": "598",
            "crit_dmge": "703",
            "armor": "440",
            "block_prof": "3556",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 5742.16 to 27149.35 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/5",
            "champid": "deadpool+5+3",
            "challenger_rating": 100,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 5730.4 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 3255 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 3775.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "5+4": {
            "rank": 4,
            "prestige": "5148",
            "hp": "20320",
            "attack": "1755",
            "crit_rate": "613",
            "crit_dmge": "721",
            "armor": "481",
            "block_prof": "3645",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 7737.45 to 36583.21 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/5",
            "champid": "deadpool+5+4",
            "challenger_rating": 110,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 7721.6 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 4387.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 5089.5 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "5+5": {
            "rank": 5,
            "prestige": "6962",
            "hp": "27435",
            "attack": "2369",
            "crit_rate": "628",
            "crit_dmge": "738",
            "armor": "525",
            "block_prof": "3734",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 10446.7 to 49392.74 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/5",
            "champid": "deadpool+5+5",
            "challenger_rating": 120,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 10425.3 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 5922.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 6870.1 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "6+1": {
            "rank": 1,
            "prestige": "5454",
            "hp": "21573",
            "attack": "1863",
            "crit_rate": "613",
            "crit_dmge": "721",
            "armor": "391",
            "block_prof": "3645",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 8214.57 to 38839.06 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/6",
            "champid": "deadpool+6+1",
            "challenger_rating": 110,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 8197.74 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 4657.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 5402.7 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "6+2": {
            "rank": 2,
            "prestige": "7533",
            "hp": "29799",
            "attack": "2573",
            "crit_rate": "628",
            "crit_dmge": "738",
            "armor": "431",
            "block_prof": "3734",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 11346.86 to 53648.78 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/6",
            "champid": "deadpool+6+2",
            "challenger_rating": 120,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 11323.62 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 6432.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 7461.7 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "6+3": {
            "rank": 3,
            "prestige": "8954",
            "hp": "35352",
            "attack": "3052",
            "crit_rate": "643",
            "crit_dmge": "756",
            "armor": "472",
            "block_prof": "3823",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 13461.33 to 63646.15 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/6",
            "champid": "deadpool+6+3",
            "challenger_rating": 130,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 13433.76 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 7630 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 8850.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "6+4": {
            "rank": 4,
            "prestige": "10244",
            "hp": "40455",
            "attack": "3493",
            "crit_rate": "658",
            "crit_dmge": "773",
            "armor": "517",
            "block_prof": "3912",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": "Permanently regenerating up to 15404.45 to 72833.36 Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Regeneration amount is tied to Deadpool's Power Meter.",
            "url_page": "https://auntm.ai/champions/deadpool/tier/6",
            "champid": "deadpool+6+4",
            "challenger_rating": 140,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 15372.9 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 8732.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 10129.7 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "1+1": {
            "rank": 1,
            "prestige": 178,
            "hp": 790,
            "attack": 67,
            "crit_rate": 463,
            "crit_dmge": 545,
            "armor": 0,
            "block_prof": 2756,
            "energy_resist": 0,
            "physical_resist": 0,
            "crit_resist": 0,
            "sig_info": null,
            "url_page": "https://auntm.ai/champions/deadpool/tier/1",
            "champid": "deadpool+1+1",
            "challenger_rating": 10,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 300.2 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 167.5 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 194.3 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "1+2": {
            "rank": 2,
            "prestige": 265,
            "hp": 1096,
            "attack": 92,
            "crit_rate": 478,
            "crit_dmge": 563,
            "armor": 0,
            "block_prof": 2845,
            "energy_resist": 0,
            "physical_resist": 0,
            "crit_resist": 0,
            "sig_info": null,
            "url_page": "https://auntm.ai/champions/deadpool/tier/1",
            "champid": "deadpool+1+2",
            "challenger_rating": 20,
            "abilities": {
                "PASSIVE": [
                    "Dropping below 20% Health activates Regeneration, recovering up to 416.48 Health over 6 seconds. This occurs only once per fight, and the amount Healed is tied to the Power Meter."
                ],
                "SPECIAL ATTACK 2": [
                    "100% chance to inflict Bleed, dealing 230 Direct Damage over 3 seconds."
                ],
                "SPECIAL ATTACK 3": [
                    "100% chance to inflict Bleed, dealing 266.8 Direct Damage over 5.50 seconds."
                ]
            }
        },
        "find": {
            "story_quests": {
                "act_1": [],
                "act_2": [
                    "2.1.1"
                ],
                "act_3": [],
                "act_4": [
                    "4.1.1",
                    "4.1.4",
                    "4.1.5",
                    "4.1.6",
                    "4.2.1",
                    "4.2.3",
                    "4.2.4",
                    "4.2.5",
                    "4.2.6",
                    "4.3.1",
                    "4.3.2",
                    "4.3.3",
                    "4.3.4",
                    "4.3.5",
                    "4.3.6",
                    "4.4.1",
                    "4.4.2",
                    "4.4.3",
                    "4.4.4",
                    "4.4.5"
                ],
                "act_5": [
                    "5.1.3",
                    "5.1.4",
                    "5.2.1",
                    "5.2.2",
                    "5.2.3",
                    "5.2.4",
                    "5.2.5",
                    "5.2.6",
                    "5.3.2",
                    "5.3.3",
                    "5.3.5",
                    "5.4.1",
                    "5.4.4",
                    "5.4.6"
                ],
                "act_6": [
                    "6.1.3",
                    "6.2.1",
                    "6.2.3",
                    "6.3.6",
                    "6.4.1",
                    "6.4.5"
                ],
                "act_7": [
                    "7.1.4",
                    "7.2.5"
                ]
            }
        }
    },
    "name": "DEADPOOL",
    "class": "Mutant",
    "img_portrait": "https://mcoc.rexians.tk/assets/portraits/deadpool.png",
    "contact": "PHYSICAL",
    "tags": [
        "Mercenary",
        "X-Men",
        "Size: M"
    ],
    "released": "12/10/2014"
}