{
    "champid": "maestro_overseer",
    "data": {
        "2+1": {
            "rank": 1,
            "prestige": "274",
            "hp": "1208",
            "attack": "84",
            "crit_rate": "261",
            "crit_dmge": "400",
            "armor": "121",
            "block_prof": "3457",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 4.2 to 25.2 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 8.4 to 67.2 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/2",
            "champid": "maestro_overseer+2+1"
        },
        "2+2": {
            "rank": 2,
            "prestige": "360",
            "hp": "1596",
            "attack": "111",
            "crit_rate": "269",
            "crit_dmge": "413",
            "armor": "144",
            "block_prof": "3565",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 5.55 to 33.3 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 11.1 to 88.8 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/2",
            "champid": "maestro_overseer+2+2"
        },
        "2+3": {
            "rank": 3,
            "prestige": "570",
            "hp": "2533",
            "attack": "176",
            "crit_rate": "277",
            "crit_dmge": "425",
            "armor": "169",
            "block_prof": "3673",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 8.8 to 52.8 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 17.6 to 140.8 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/2",
            "champid": "maestro_overseer+2+3"
        },
        "3+1": {
            "rank": 1,
            "prestige": "495",
            "hp": "2190",
            "attack": "152",
            "crit_rate": "277",
            "crit_dmge": "425",
            "armor": "128",
            "block_prof": "3673",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 7.6 to 45.6 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 15.2 to 121.6 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/3",
            "champid": "maestro_overseer+3+1"
        },
        "3+2": {
            "rank": 2,
            "prestige": "791",
            "hp": "3504",
            "attack": "243",
            "crit_rate": "285",
            "crit_dmge": "438",
            "armor": "153",
            "block_prof": "3781",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 12.15 to 72.9 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 24.3 to 194.39 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/3",
            "champid": "maestro_overseer+3+2"
        },
        "3+3": {
            "rank": 3,
            "prestige": "1104",
            "hp": "4901",
            "attack": "340",
            "crit_rate": "294",
            "crit_dmge": "450",
            "armor": "179",
            "block_prof": "3890",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 17 to 102.01 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 34 to 271.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/3",
            "champid": "maestro_overseer+3+3"
        },
        "3+4": {
            "rank": 4,
            "prestige": "1522",
            "hp": "6730",
            "attack": "467",
            "crit_rate": "302",
            "crit_dmge": "463",
            "armor": "206",
            "block_prof": "3998",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 23.35 to 140.11 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 46.7 to 373.59 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/3",
            "champid": "maestro_overseer+3+4"
        },
        "4+1": {
            "rank": 1,
            "prestige": "1108",
            "hp": "4898",
            "attack": "340",
            "crit_rate": "294",
            "crit_dmge": "450",
            "armor": "223",
            "block_prof": "3890",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 17 to 102.01 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 34 to 271.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/4",
            "champid": "maestro_overseer+4+1"
        },
        "4+2": {
            "rank": 2,
            "prestige": "1557",
            "hp": "6870",
            "attack": "477",
            "crit_rate": "302",
            "crit_dmge": "463",
            "armor": "253",
            "block_prof": "3998",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 23.85 to 143.11 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 47.7 to 381.59 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/4",
            "champid": "maestro_overseer+4+2"
        },
        "4+3": {
            "rank": 3,
            "prestige": "2181",
            "hp": "9626",
            "attack": "668",
            "crit_rate": "310",
            "crit_dmge": "475",
            "armor": "284",
            "block_prof": "4106",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 33.4 to 200.41 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 66.8 to 534.38 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/4",
            "champid": "maestro_overseer+4+3"
        },
        "4+4": {
            "rank": 4,
            "prestige": "2870",
            "hp": "12648",
            "attack": "877",
            "crit_rate": "318",
            "crit_dmge": "488",
            "armor": "318",
            "block_prof": "4214",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 43.85 to 263.12 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 87.7 to 701.58 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/4",
            "champid": "maestro_overseer+4+4"
        },
        "4+5": {
            "rank": 5,
            "prestige": "3829",
            "hp": "16876",
            "attack": "1171",
            "crit_rate": "326",
            "crit_dmge": "500",
            "armor": "353",
            "block_prof": "4322",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 58.55 to 351.32 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 117.1 to 936.77 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/4",
            "champid": "maestro_overseer+4+5"
        },
        "5+1": {
            "rank": 1,
            "prestige": "2293",
            "hp": "10071",
            "attack": "699",
            "crit_rate": "310",
            "crit_dmge": "475",
            "armor": "446",
            "block_prof": "4106",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 42.76 to 279.6 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 89.99 to 699 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/5",
            "champid": "maestro_overseer+5+1"
        },
        "5+2": {
            "rank": 2,
            "prestige": "3028",
            "hp": "13304",
            "attack": "923",
            "crit_rate": "318",
            "crit_dmge": "488",
            "armor": "488",
            "block_prof": "4214",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 56.47 to 369.2 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 118.83 to 923 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/5",
            "champid": "maestro_overseer+5+2"
        },
        "5+3": {
            "rank": 3,
            "prestige": "4244",
            "hp": "18598",
            "attack": "1290",
            "crit_rate": "326",
            "crit_dmge": "500",
            "armor": "532",
            "block_prof": "4322",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 78.92 to 516 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 166.08 to 1290 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/5",
            "champid": "maestro_overseer+5+3"
        },
        "5+4": {
            "rank": 4,
            "prestige": "5717",
            "hp": "25061",
            "attack": "1738",
            "crit_rate": "334",
            "crit_dmge": "513",
            "armor": "579",
            "block_prof": "4430",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 106.33 to 695.21 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 223.76 to 1737.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/5",
            "champid": "maestro_overseer+5+4"
        },
        "5+5": {
            "rank": 5,
            "prestige": "7738",
            "hp": "33837",
            "attack": "2346",
            "crit_rate": "342",
            "crit_dmge": "525",
            "armor": "628",
            "block_prof": "4538",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 143.53 to 938.41 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 302.04 to 2345.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/5",
            "champid": "maestro_overseer+5+5"
        },
        "6+1": {
            "rank": 1,
            "prestige": "6052",
            "hp": "26607",
            "attack": "1845",
            "crit_rate": "334",
            "crit_dmge": "513",
            "armor": "481",
            "block_prof": "4430",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 112.88 to 738.01 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 237.54 to 1844.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/6",
            "champid": "maestro_overseer+6+1"
        },
        "6+2": {
            "rank": 2,
            "prestige": "8360",
            "hp": "36752",
            "attack": "2549",
            "crit_rate": "342",
            "crit_dmge": "525",
            "armor": "525",
            "block_prof": "4538",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 155.95 to 1019.61 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 328.17 to 2548.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/6",
            "champid": "maestro_overseer+6+2"
        },
        "6+3": {
            "rank": 3,
            "prestige": "9944",
            "hp": "43600",
            "attack": "3023",
            "crit_rate": "351",
            "crit_dmge": "538",
            "armor": "572",
            "block_prof": "4646",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 184.94 to 1209.21 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 389.2 to 3022.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/6",
            "champid": "maestro_overseer+6+3"
        },
        "6+4": {
            "rank": 4,
            "prestige": "11381",
            "hp": "49894",
            "attack": "3460",
            "crit_rate": "359",
            "crit_dmge": "550",
            "armor": "621",
            "block_prof": "4754",
            "energy_resist": "0",
            "physical_resist": "0",
            "crit_resist": "0",
            "sig_info": [
                "If an Opponent ability fails due to his personal immunity or reduced Ability Accuracy they take a burst of 211.68 to 1384.01 Physical Damage and the Overseer gains one Gamma Power. This Damage scales with Base Attack Only. This effect has a 1 second cooldown.",
                "Striking the Opponent while they are recovering from Heavy or Specials Attacks deal a burst of 445.46 to 3459.99 Physical Damage. This effect has a 1 second cooldown."
            ],
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/6",
            "champid": "maestro_overseer+6+4"
        },
        "1+1": {
            "rank": 1,
            "prestige": 214,
            "hp": 946,
            "attack": 66,
            "crit_rate": 253,
            "crit_dmge": 388,
            "armor": 117,
            "block_prof": 3349,
            "energy_resist": 0,
            "physical_resist": 0,
            "crit_resist": 0,
            "sig_info": null,
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/1",
            "champid": "maestro_overseer+1+1"
        },
        "1+2": {
            "rank": 2,
            "prestige": 295,
            "hp": 1309,
            "attack": 91,
            "crit_rate": 261,
            "crit_dmge": 400,
            "armor": 140,
            "block_prof": 3457,
            "energy_resist": 0,
            "physical_resist": 0,
            "crit_resist": 0,
            "sig_info": null,
            "url_page": "https://auntm.ai/champions/maestro_overseer/tier/1",
            "champid": "maestro_overseer+1+2"
        }
    },
    "name": "THE OVERSEER",
    "img_potrait": "https://mcoc.rexians.tk/assets/potraits/maestro_overseer.png",
    "class": "Science"
}