{
    "data": {
        "0": {
            "node_name": "Null",
            "node_info": "No node found"
        },
        "1": {
            "node_name": "A Good Defense",
            "node_info": "The Attacker's Well-Timed Blocks place a random Debuff from Weakness, Armor Break, Suppression, or Disorient on the Defender for 13 second(s). Each time the Attacker Dodges an Attack, place a random Buff from Fury, Armor Up, Power Gain, or Precision on the Attacker for 13 second(s)."
        },
        "2": {
            "node_name": "Academic Constitution",
            "node_info": "Science Attackers reduce the potency of the Defender's Poison effects by 85%. Additionally, whenever a Science Attacker dodges an attack or performs a Well-Timed block all their Poison Debuffs and Passives are removed."
        },
        "3": {
            "node_name": "Adaptive",
            "node_info": "Cycles between building up Physical Resistance or Energy Resistance every X seconds."
        },
        "4": {
            "node_name": "Advanced Force Field",
            "node_info": "If Guardian is affected by a Debuff, Force Field Charges are gained an additional 6 second(s) faster."
        },
        "5": {
            "node_name": "Aegis (Heavy) 1",
            "node_info": "The Defender begins with 2 Indestructible charges. Each Heavy Attack strike against the Defender removes 1 charge."
        },
        "6": {
            "node_name": "Aegis (Heavy) 2",
            "node_info": "The Defender begins with 4 Indestructible charges. Each Heavy Attack strike against the Defender removes 1 charge."
        },
        "7": {
            "node_name": "Aegis (Intercept) 1",
            "node_info": "The Defender begins with 1 Indestructible charge(s). Intercepting the Defender's Attack removes 1 charge."
        },
        "8": {
            "node_name": "Aegis (Intercept) 3",
            "node_info": "The Defender begins with 3 Indestructible charge(s). Intercepting the Defender's Attack removes 1 charge."
        },
        "9": {
            "node_name": "Aggression: Cruelty",
            "node_info": "Every 2 seconds on a timer, gain a Cruelty passive increasing Critical Damage by 150% per stack. When struck, reset the timer and remove a Cruelty passive stack."
        },
        "10": {
            "node_name": "Aggression: Regeneration",
            "node_info": "Every 2 seconds on a timer, gain a Regeneration passive that heals 0.25% of Max Health every second per stack. When struck, reset the timer and remove a Regeneration passive stack."
        },
        "11": {
            "node_name": "Aggression: Armor",
            "node_info": "Every 2 seconds on a timer, gain an Armor Up passive increasing Armor by 50% per stack. When struck, reset the timer and remove a Armor Up passive stack."
        },
        "12": {
            "node_name": "Aggression: Fury",
            "node_info": "Every 2 seconds on a timer, gain a Fury passive increasing Attack by 50% per stack. When struck, reset the timer and remove a Fury passive stack."
        },
        "13": {
            "node_name": "Aggression: Precision",
            "node_info": "Every 2 seconds on a timer, gain a Precision passive increasing Critical Hit Chance by 25% per stack. When struck, reset the timer and remove a Precision passive stack."
        },
        "14": {
            "node_name": "Aggression: Prowess",
            "node_info": "Every 2 seconds, the Defender gains a Prowess Passive increasing Special Attack damage by 50% per stack. When the Defender is struck, remove a stack."
        },
        "15": {
            "node_name": "Aggressive",
            "node_info": "This defender is more aggressive and excels at offensive abilities like Heavy and Dash Attacks."
        },
        "16": {
            "node_name": "All Or Nothing",
            "node_info": "This defender is less likely to activate Special Attack 1 or 2 and far more likely to activate Special Attack 3."
        },
        "17": {
            "node_name": "Anamnesis",
            "node_info": "Break the normal limitations of a Genetic Memory with perfect recollection of up to 20 effects."
        },
        "18": {
            "node_name": "Ancient Knowledge",
            "node_info": "All Champion classes but Mystic reduce their Attack by X%."
        },
        "19": {
            "node_name": "Apex Manufacture",
            "node_info": "Sentinel gains Analysis Charges at twice the normal rate, and their attacks deal 1% additional True Damage per Charge."
        },
        "20": {
            "node_name": "Arc Converter",
            "node_info": "When damaged by a Special Attack and Stark Tech AI is active, this enemy gains 1 bar of Power."
        },
        "21": {
            "node_name": "Arc Overload 2.0",
            "node_info": "Every 20 seconds, this Defender triggers an Arc Overload, gaining an Armor Up Buff which increases Armor by 25% and a Regeneration Buff which heals 25% of Max Health. These Buffs last for 6 seconds."
        },
        "22": {
            "node_name": "Arc Overload 2.1",
            "node_info": "Every 15 seconds, this Defender triggers an Arc Overload, gaining an Armor Up Buff which increases Armor by 25% and a Regeneration Buff which heals 25% of Max Health. These Buffs last for 6 seconds."
        },
        "23": {
            "node_name": "Arc Overload 2.2",
            "node_info": "Every 10 seconds, this Defender triggers an Arc Overload, gaining an Armor Up Buff which increases Armor by 25% and a Regeneration Buff which heals 25% of Max Health. These Buffs last for 6 seconds."
        },
        "24": {
            "node_name": "Arcane Torrent",
            "node_info": "For each Buff on the Defender, Mystic Attackers gain: +25% Ability Accuracy +10% Attack +25% Bleed Debuff Duration +25% Armor Break Debuff Duration +10% Power Rate"
        },
        "25": {
            "node_name": "Arcane Zeal",
            "node_info": "Whenever a Mystic Attacker fills a Bar of Power they gain a Passive Prowess increasing Special Attack Damage by 80% for 15 seconds. Nullifying a Buff from the Defender converts all temporary Prowess Passives into indefinite ones. Max stacks 5."
        },
        "26": {
            "node_name": "Armor",
            "node_info": "+X% Armor"
        },
        "27": {
            "node_name": "Armor Break Immunity",
            "node_info": "The Defender is Immune to Armor Break Debuffs."
        },
        "28": {
            "node_name": "Armored Assault",
            "node_info": "While the Defender has a Armor Up Buff active they gain +65% attack rating and they become Passsively Unblockable."
        },
        "29": {
            "node_name": "Arrogance",
            "node_info": "Every 10 hits on the Attacker's Combo Meter afflicts them with a Falter Passive. Falter causes their attacks to Miss, and lasts 3 second(s). When the Attacker is Struck, Falter is removed."
        },
        "30": {
            "node_name": "Aspect of Chaos",
            "node_info": "Every 10 seconds, the Attacker and Defender temporarily switch Health Bars for 4 seconds, and then switch back."
        },
        "31": {
            "node_name": "Aspect of Death",
            "node_info": "As this Defender activates a Special Attack, their successful hits become lethal for 4 seconds plus 1 additional second(s) for each knocked out member of the Attacker's team."
        },
        "32": {
            "node_name": "Aspect of Evolution",
            "node_info": "Whenever this Defender fills a bar of Power, they raise their Attack, Armor, Critical Rating, Critical Resistance, Block Penetration, Power Rate, and Ability Accuracy attributes by 5% for the remainder of the fight."
        },
        "33": {
            "node_name": "Aspect of Genesis",
            "node_info": "Once per fight, when this Defender drops below 15% Health, they Regenerate 24% Health over 6 seconds and nearby Attackers Degenerate or Regenerate the inverse amount."
        },
        "34": {
            "node_name": "Aspect of Nightmares",
            "node_info": "Attackers Degenerate 50% Health over 12 seconds, but then Regenerate 50% Health instanly."
        },
        "35": {
            "node_name": "Aspect of War",
            "node_info": "At the start of the fight, the Attacker's Block Proficiency begins to decay to 0 over 50 seconds and this Defender is Unblockable against enemies with 0 Block Proficiency. In addition, this Defender gains gains Unstoppable and Stun Immunity for 6 seconds when activating a Special Attack. The Unstoppable effect is removed prematurely if the player intercepts any Dash or Heavy attack."
        },
        "36": {
            "node_name": "Attack",
            "node_info": "+X% Attack"
        },
        "37": {
            "node_name": "Backblast",
            "node_info": "The Atacker's Critical Damage is doubled, however if damage from a critical hit exceeds 5% of the Defender's max health or the Attacker lands 4 or more guaranteed crits throughout the fight, the Attacker suffers from an Incinerate Debuff dealing damage equal to their last crit over 5 seconds."
        },
        "38": {
            "node_name": "Backboard Brawler",
            "node_info": "While the Defender is pinned against a wall, they gain a permanent Passive Fury and Passive Armor every X seconds. Each Fury increases their base Attack by X% ip to X%, and each Armor increases their Armor Rating by X up to X."
        },
        "39": {
            "node_name": "Backlash Pulse",
            "node_info": "Whenever a Buff would be triggered by the Attacker, the suffer 25% of the Defender's Attack in damage and are Drained of 25% of their Max Power."
        },
        "40": {
            "node_name": "Backup Recovery - 1",
            "node_info": "When brought below 50% Health the Defender gains a burst of 20% Power. If a reduction to Ability Accuracy prevents this, the defender instead recovers 15% Max Health."
        },
        "41": {
            "node_name": "Backup Recovery - 3",
            "node_info": "When brought below 50% Health the Defender gains a burst of 30% Power. If a reduction to Ability Accuracy prevents this, the defender instead recovers 25% Max Health."
        },
        "42": {
            "node_name": "Bane",
            "node_info": "Whichever Champion lands the first hit will place a Curse on the opposing Champion which deals 0.5% of their current Health as Direct Damage per second. Whenever a Champion with the Curse strikes the other Champion or if the Curse has been on the same Champion for 10 seconds, it passes to the other Champion."
        },
        "43": {
            "node_name": "Bane of Damballah",
            "node_info": "The Defender deals 50% additional damage and has 10% Life Steal as long as the Attacker is under a beneficial effect."
        },
        "44": {
            "node_name": "Bane of Hell's Kitchen",
            "node_info": "Heavy Attacks gain +60% Attack and cannot trigger a Passive Evade."
        },
        "45": {
            "node_name": "Berserker Barrage",
            "node_info": "Whenever the Attacker is not under the effect of a Regeneration Buff, the Defender gains a passive Fury every 1 second(s). Each Fury increases the Defender's Attack by 50%. All Fury effects are removed if the Defender gains a Regeneration Buff."
        },
        "46": {
            "node_name": "Binary Might",
            "node_info": "Captain Marvel starts the fight with X Energy Charges and activating Binary Ignition causes Captain Marvel to fight more aggressively."
        },
        "47": {
            "node_name": "Biohazard",
            "node_info": "When struck 20% chance to inflict Bleed, dealing 100% of Attack as direct damage over 7.5 seconds. When blocking an attack, 50% chance to inflict Poison, dealing 100% of Attack as direct damage over 7.5 seconds."
        },
        "48": {
            "node_name": "Bleed",
            "node_info": "Inflicts Bleed, draining X% Health over X seconds."
        },
        "49": {
            "node_name": "Bleed Vulnerability",
            "node_info": "This enemy takes 200% more damage while under the effects of Bleed."
        },
        "50": {
            "node_name": "Block Erosion",
            "node_info": "Whenever Block Proficiency exceeds X%, up to X% is lost per second until X% remains."
        },
        "51": {
            "node_name": "Block Unblockable: Specials",
            "node_info": "This Defender can block Unblockable Special Attacks."
        },
        "52": {
            "node_name": "Blood in the Water - 1",
            "node_info": "While the Attacker is suffering from a Debuff, the Defender gains a Passive Fury granting +100% Attack Rating lasting until all Debuffs on the Attacker expire."
        },
        "53": {
            "node_name": "Blood in the Water - 2",
            "node_info": "While the Attacker is suffering from a Debuff, the Defender gains a Passive Fury granting +150% Attack Rating lasting until all Debuffs on the Attacker expire."
        },
        "54": {
            "node_name": "Blood in the Water - 3",
            "node_info": "While the Attacker is suffering from a Debuff, the Defender gains a Passive Fury granting +200% Attack Rating lasting until all Debuffs on the Attacker expire."
        },
        "55": {
            "node_name": "Bloodletting",
            "node_info": "Increase the duration of Bleed effects by X%."
        },
        "56": {
            "node_name": "Boost Buff (Armor Up) 1",
            "node_info": "The Defender's Armor Up Buffs gain +25% duration and Ability Accuracy. When struck with a Critical Hit, the Defender will remove 1 Armor Up Buff to reduce the damage to 0."
        },
        "57": {
            "node_name": "Boost Buff (Unstoppable) 2",
            "node_info": "The Defender's Unstoppable Buffs gain +50% duration and Ability Accuracy. While an Unstoppable Buff is active, the Defender fights more aggressively."
        },
        "58": {
            "node_name": "Brand of the Abyss I",
            "node_info": "Defender has a X% chance to Evade attacks. X% chance instead if they have a Class Advantage."
        },
        "59": {
            "node_name": "Brand of the Abyss II",
            "node_info": "Defender's Basic Attacks have a X% chance to Stun & Special Attacks have a X% chance to Stun for X seconds. Attacker's damage-per-hit is capped at X."
        },
        "60": {
            "node_name": "Brand of the Abyss III",
            "node_info": "Special 3 is unlocked & gains +X% Attack rating."
        },
        "61": {
            "node_name": "Brand of the Abyss IV",
            "node_info": "If the Defender has a Class Advantage, they also gain +X% Power Rate, +X% Power Gain Rate, +X Block Penetration and their damage cap is reduced to X per hit."
        },
        "62": {
            "node_name": "Brand of the Abyss V",
            "node_info": "Defender begins the fight with a number of Skirmish charges based on the Attacker's Challenge Rating. When the Defender is struck, blocks an attack or lands an attack X Charge is lost. When the charges run out, the Defender will fight more erratically and gain +X% Attack and Ability Accuracy."
        },
        "63": {
            "node_name": "Brand of the Abyss VI",
            "node_info": "When all Skirmish Charges are depleted, the Defender will gain an equal number od Warfare Charges which are lost in the same way as Skirmish Charges. When they have depleted, the Defender gains X bars of Power and becomes permanently Unstoppable and Unblockable."
        },
        "64": {
            "node_name": "Brand of the Abyss VII",
            "node_info": "If the Attacker hasn't landed an attack in X seconds, the Defender gains a Rampage Charge until they are struck. Rampage grants +X% Attack rating, causes Skirmish & Warfare Charge to slowly deplete & causes the Defender to fight more aggressively."
        },
        "65": {
            "node_name": "Brave and the Boulder",
            "node_info": "The last hit of Special Attack 2 grants a Fury Buff for 6 seconds, increasing Attack by 15%."
        },
        "66": {
            "node_name": "Brawl",
            "node_info": "Every 10 seconds, both Champions gain an Unstoppable passive for 5 seconds."
        },
        "67": {
            "node_name": "Breakthrough",
            "node_info": "This Champion starts with +5000 Armor Rating, but the Opponent reduces their Armor Rating by 200 with each Hit."
        },
        "68": {
            "node_name": "Brute Force",
            "node_info": "If the Attacker hasn't landed a hit in 6 seconds they begin to Degenerate, losing 100% of their total Health over 30 seconds. Landing a hit removes the Degeneration and resets the timer. The strength of this Degeneration is affected by Class Relationships."
        },
        "69": {
            "node_name": "Bubble Shield - 1",
            "node_info": "Each Blocked attack reduces Block Proficiency by 2%. After 10 stacks, the next attack in Unblockable."
        },
        "70": {
            "node_name": "Buff Duration",
            "node_info": "All Buffs for this champion last X% longer."
        },
        "71": {
            "node_name": "Buff Imbalance - Power Drain",
            "node_info": "Whenever the Defender gains a Buff, the Attacker receives an indefinite Power Drain Debuff, draining 10% of a Bar of Power every 6 second{s}. These Power Drains are all removed when the Attacker lands a Special Attack."
        },
        "72": {
            "node_name": "Buff Imbalance - Weakness",
            "node_info": "Whenever the Defender gains a Buff, the Attacker receives an indefinite Weakness Debuff, decreasing Attack Rating by 15%. These Weaknesses are all removed when the Attacker lands a Special Attack."
        },
        "73": {
            "node_name": "Buff Toggle (Unstoppable) - 1",
            "node_info": "Every 10 seconds, the Defender gains an Unstoppable Buff for 2 seconds."
        },
        "74": {
            "node_name": "Buff Toggle (Unstoppable) - 2",
            "node_info": "Every 9 seconds, the Defender gains an Unstoppable Buff for 3 seconds."
        },
        "75": {
            "node_name": "Buffed Up",
            "node_info": "This Defender takes 100% less damage while the Attacker has less than 3 Buffs applied to them. These Buffs can be of the same type."
        },
        "76": {
            "node_name": "Buffet - 3",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender Regenerates 15% of their Max Health."
        },
        "77": {
            "node_name": "Bulk Up",
            "node_info": "While the Attacker is charging a Heavy Attack, they rapidly gain Fury effects that increase Attack by 1%. These Fury effects can stack up to 200 and are removed upon taking damage."
        },
        "78": {
            "node_name": "Burden of Might",
            "node_info": "The Opponent's Power Gained by striking or being struck by their opponent is reduced by 15% for each Buff currently active on them. Additionally each time a Buff activates on them for any reason, they lose 25% of their Max Power."
        },
        "79": {
            "node_name": "Caltrops",
            "node_info": "Dashing backwards against this enemy causes you to Bleed for X seconds."
        },
        "80": {
            "node_name": "Can't Stop Won't Stop",
            "node_info": "The duration of the Attacker's Unstoppable effects is increased by X%, however the Defender takes X% less Damage unless the Attacker is Unstoppable."
        },
        "81": {
            "node_name": "Can't Touch This",
            "node_info": "The Defender has a passive 50% chance to Evade all attacks in addition to any base abilities."
        },
        "82": {
            "node_name": "Catch This!",
            "node_info": "If Spider-Man (Stealth Suit) evades an attack, the Attacker is inflicted with the loaded Web Cartridge Debuff."
        },
        "83": {
            "node_name": "Caustic Temper",
            "node_info": "The Defender has a 50% chance to inflict Poison when struck, dealing for 15% of the Attacker's Max Health over 10 seconds. Additionally, if the Attacker has no active Fury Buffs, the Defender takes 90% less damage."
        },
        "84": {
            "node_name": "Chair Larceny",
            "node_info": "Maximum Flux increases by 25%."
        },
        "85": {
            "node_name": "Champion Boost",
            "node_info": "+X% Attack and Health"
        },
        "86": {
            "node_name": "Changing Winds",
            "node_info": "Ronin changes Stances every 6 seconds."
        },
        "87": {
            "node_name": "Chaos",
            "node_info": "Anyone's Special Attack causes random effects on both Champions."
        },
        "88": {
            "node_name": "Checkmate",
            "node_info": "Attacks ignore Armor and Evasion with a Combo of 15 or more."
        },
        "89": {
            "node_name": "Chitinous Thorns",
            "node_info": "If the Defender has an Armor Up Buff, the Attacker is inflicted with a Bleed Debuff causing 50% of the Defender's Attack over 5 seconds, each time Contact is made."
        },
        "90": {
            "node_name": "Chronal Anchor",
            "node_info": "Opponents are petrified for 1 second after they fill a bar of Power, reducing their Regeneration and Power Gain effectiveness by 80%."
        },
        "91": {
            "node_name": "Clapback",
            "node_info": "When a Poison, Shock, Bleed, Incinerate, or Plasma Debuff is placed on the Defender, the same Debuff is placed to the Attacker, dealing X% of the Defender's Attack over X second(s)."
        },
        "92": {
            "node_name": "Close Encounters",
            "node_info": "While close to the Defender the Attacker Regenerates X% of their Max Health every second. While far away from the Defender, the Attacker Degenerates X% of their Max Health every second."
        },
        "93": {
            "node_name": "Cold Turkey I",
            "node_info": "Whenever the Attacker purifies a Debuff they receive a burst of Degeneration Damage dealing 20% Attack."
        },
        "94": {
            "node_name": "Collar Tech V",
            "node_info": "Gives Tech Champions a field that inhibits enemy Power Gain by 18%."
        },
        "95": {
            "node_name": "Colorblind",
            "node_info": "For each champion of the same class on the Attacker's team, they suffer a Degeneration of X% of their max health over X seconds at the start of the fight."
        },
        "96": {
            "node_name": "Combo Lock",
            "node_info": "Your Combo Meter is never reset while fighting this enemy."
        },
        "97": {
            "node_name": "Combo Party",
            "node_info": "For every 10 hits on their Combo Meter, the Attacker gains a permanent Cruelty Buff, granting +500 Crit Damage Rating. When struck, the Attacker loses all Cruelty Buffs if their combo meter is lost and takes 40% of the Defender's attack as direct damage for each Cruelty Buff removed this way."
        },
        "98": {
            "node_name": "Combo Shield",
            "node_info": "The Combo Meter is not reset after being struck by an attack."
        },
        "99": {
            "node_name": "Combo Up - 2",
            "node_info": "Every 1 second(s) the Defender's Combo Meter increases by 1. If the Attacker performs an intercept this timer is paused for 10 seconds."
        },
        "100": {
            "node_name": "Combo Up - 3",
            "node_info": "Every 0.2 second(s) the Defender's Combo Meter increases by 1. If the Attacker performs an intercept this timer is paused for 5 seconds."
        },
        "101": {
            "node_name": "Composite Construction",
            "node_info": "All Tech Champions in this fight are Immune to Ability Accuracy Modification."
        },
        "102": {
            "node_name": "Conflictor - 1",
            "node_info": "Every 7 seconds the next Debuff activated on the Defender is immediately Purified. Each time this triggers, the Defender gains 25% of a bar of power."
        },
        "103": {
            "node_name": "Conflictor - 2",
            "node_info": "Every 7 seconds the next Debuff activated on the Defender is immediately Purified. Each time this triggers, the Defender gains 50% of a bar of power."
        },
        "104": {
            "node_name": "Confusion 1",
            "node_info": "The Attacker suffers from Reversed Controls for the first 10 seconds of the fight."
        },
        "105": {
            "node_name": "Contagion",
            "node_info": "Whenever the Defender is struck or blocks an attack, there is a 20% chance to inflict the Attacker with a Posion Debuff, dealing 100% of the Defender's modified Attack as direct damage over 10 seconds."
        },
        "106": {
            "node_name": "Contest Champion",
            "node_info": "Aegon carries 100% of his Combo Meter between fights."
        },
        "107": {
            "node_name": "Coolant Leak",
            "node_info": "Whenever a Robotic Attacker would gain a Bleed Debuff, they instead gain an Incinerate which deals X% of the Defender's attack as direct damage over X seconds."
        },
        "108": {
            "node_name": "Cornered",
            "node_info": "Whenever a damage over time Debuff is applied to the Defender, they gain 300% more power for the duration of the Debuff."
        },
        "109": {
            "node_name": "Cosmic Grit",
            "node_info": "Cosmic Attackers who reach a total of 4 Fury, Armor Up, or Precision Buffs gain an indefinite Aptitude Buff increasing the potency of all future Fury, Armor Up, and Precision Buffs by 25% each time they gain a Fury, Armor Up, or Precision Buff beyond 4. Max stacks 20."
        },
        "110": {
            "node_name": "Counter Tactics",
            "node_info": "The Defender increases Base Attack by 20% for each hit of the Attacker's Combo Meter."
        },
        "111": {
            "node_name": "Counterstrike",
            "node_info": "Using the Dexterity Mastery to dodge an attack grants the Attacker a Passive Fury charge, increasing their Attack Rating by X% per charge. At X Fury charges all charges are lost and the Defender's attacks are Unblockable for X seconds."
        },
        "112": {
            "node_name": "Coward",
            "node_info": "Whenever the Attacker enters into a block, they deal X% of the Defender's Max Health as direct damage to the Defender. Damage done to the Defender is capped at X%. All of the Defender's attacks are Unblockable."
        },
        "113": {
            "node_name": "Crack in the Armor",
            "node_info": "Each time a Cosmic Attacker lands an attack they have a 10% chance for each Armor Break on the Defender to gain an indefinite Passive Fury increasing Attack Rating by 35%. Max Stacks 10."
        },
        "114": {
            "node_name": "Crackling Energy",
            "node_info": "Striking the Defender with a Contact attack puts a Passive Energy Damage over time effect on the Attacker dealing X% of their max health every second for X seconds, stacking up to X times. Striking the Defender with a Non-Contact attack Removes all stacks."
        },
        "115": {
            "node_name": "Crippling Failure",
            "node_info": "Whenever an Attacker's ability fails to trigger due to chance, they are inflicted with Heal Block and Power Lock Debuffs for 2 seconds."
        },
        "116": {
            "node_name": "Crit Me With Your Best Shot",
            "node_info": "This Defender takes 100% less damage from hits that are not Critical."
        },
        "117": {
            "node_name": "Critical (Damage)",
            "node_info": "+X% Critical Damage"
        },
        "118": {
            "node_name": "Critical (Rate)",
            "node_info": "+X% Critical Rate"
        },
        "119": {
            "node_name": "Critical Setup",
            "node_info": "When the Attacker ends Combo with the same attack they ended their previous combo with, the attack is a guaranteed Critical Hit."
        },
        "120": {
            "node_name": "Crumbling Armor",
            "node_info": "If the attacker hasn't landed a hit in 6 seconds they receive an Armor Break Debuff, reducing their Armor by 250. If an Armor Break is active on the Attacker when they trigger an Armor Up Buff, an additional Armor Break Debuff is triggered. Landing a hit removes an Armor Break and resets the timer."
        },
        "121": {
            "node_name": "Cultivating Mass",
            "node_info": "Attacker's Buff duration is increased by 25% for #Size: XL Champions."
        },
        "122": {
            "node_name": "Cutting Wires",
            "node_info": "Whenever a Robotic Attacker would gain a Bleed Debuff, they instead gain a Shock Debuff dealing 50% of the Defender's Attack Rating as Direct Damage over 5 seconds."
        },
        "123": {
            "node_name": "Dark Intellect",
            "node_info": "Well timed Blocks against contact attacks have a 100% chance to inflict Degeneration, dealing 90% of Attack as Direct Damage over 3 second(s)."
        },
        "124": {
            "node_name": "Dash Vulnerability",
            "node_info": "This enemy takes 200% more damage during a forward Dash attack."
        },
        "125": {
            "node_name": "Death's Embrace",
            "node_info": "At the start of the fight and every 30 seconds, Hela gains a Fury. Upon activating a Fury, Hela becomes Unstoppable for 5 seconds. Hela's Spirits drain at a significantly reduced rate."
        },
        "126": {
            "node_name": "Debilitate",
            "node_info": "Debuff effects last 100% longer."
        },
        "127": {
            "node_name": "Decimation",
            "node_info": "Starts the fight with a Fury Buff against Mutant Champions, granting +15% Attack Rating."
        },
        "128": {
            "node_name": "Defensive",
            "node_info": "This defender is more passive and excels at defensive abilities like Blocking and Dodging."
        },
        "129": {
            "node_name": "Degeneration",
            "node_info": "Inflicts Health Degeneration, draining X% Health per second."
        },
        "130": {
            "node_name": "Delirium",
            "node_info": "The Attacker's Dash and Dodge controls are inverted in this fight. Robots and champions with Psychic Resistance are immune to this effect."
        },
        "131": {
            "node_name": "Destructive Feedback",
            "node_info": "At the start of the fight, the Defender gains a Kinetic Shield preventing damage for 10 seconds. While active, all damage that is attempted by the Attacker excluding damage from Special 3 attacks is stored. When the shield expires the Defender takes a burst of direct damage equal to the stored damage. If the Defender makes contact with the Attacker the direct damage is burst onto them instead. When this shield expires there is a 15 second cooldown before it activates again."
        },
        "132": {
            "node_name": "Disarray",
            "node_info": "Whenever either Champion triggers a Special Attack, both Champions receive a random effect."
        },
        "133": {
            "node_name": "Dismay",
            "node_info": "Whenever the Attacker loses their highest achieved Combo in a Fight, they gain a Degeneration Debuff that deals damage every second equal to 10 times the lost Combo."
        },
        "134": {
            "node_name": "Diss Track",
            "node_info": "The Defender takes 100% less damage while they have less than 3 Debuffs applied to them. These Debuffs can be of the same type."
        },
        "135": {
            "node_name": "Divine Barrier - 3",
            "node_info": "While fighting a Mystic Attacker, every 10 second(s) on a timer, the Defender becomes immune to Nullify, Fateseal and Stagger effects for 10 second(s). The timer's duration is paused for 2 second(s) each time the Attacker nullifies a Buff."
        },
        "136": {
            "node_name": "Dizzy",
            "node_info": "Each time the Defender successfully Evades an attack, inflict a Disorient Debuff reducing Defensive Ability Accuracy by 20% and Block Efficiency by 50% for 12 seconds."
        },
        "137": {
            "node_name": "Do Not Disturb - 2",
            "node_info": "The Defender has 100% increased Ability Accuracy. Each Non-Damaging Debuff reduces potency by 25%."
        },
        "138": {
            "node_name": "Do Not Go Gentle",
            "node_info": "The Attacker gains 1 charge for every 5 hits in their combo meter. When the Defender receives damage from any source that would knock them out and the Attacker has 1 or more charges, a charge is consumed instead and the Attacker receives damage equal to the Defender's attack, 2 charges are removed with no penalty. Landing a Heavy Attack also removes up to 1 charge with no penalty."
        },
        "139": {
            "node_name": "Do You Bleed?",
            "node_info": "This Defender takes 100% less damage from any sources except Bleed."
        },
        "140": {
            "node_name": "Double Tap",
            "node_info": "Whenever Elsa fires any of her Enhanced Munitions she will consume 2 rounds and apply 2 Debuffs."
        },
        "141": {
            "node_name": "Double or Nothing",
            "node_info": "Roll for a second Gambler's Fate effect."
        },
        "142": {
            "node_name": "Down but Not Out",
            "node_info": "When Captain Marvel is knocked down she gains 3 Energy Charges."
        },
        "143": {
            "node_name": "Duel",
            "node_info": "For the first 5 seconds, both Champions are Indestructible, after which both Champion's attacks will deal damage equal to their Current Health."
        },
        "144": {
            "node_name": "Dulled",
            "node_info": "Crit Chance is reduced by 50% for each Buff active on you and each Debuff active on your Opponent."
        },
        "145": {
            "node_name": "Duodenum Prod",
            "node_info": "An advanced poking technique designed to increase yields of enemy body fluids."
        },
        "146": {
            "node_name": "E.M.P. Modification",
            "node_info": "Whenever the attacker gains a Buff, the Defender gains an Overclock charge. Max 10 stacks. For each charge, the Defender deals +15% Energy Damage with each strike. Defender's Special Attacks convert all charges into Passive Shocks, each dealing 25% of Attack as Energy Damage over 10 seconds."
        },
        "147": {
            "node_name": "ENRAGE",
            "node_info": "After a period of time from the start of the fight, become Enraged and gain additional Attack Damage, Ability Accuracy, Critical Rate, and Critical Damage. If Enrage continues, become further Enraged and gain additional effects. Opponents with greater Attack increase the amount of time before becoming Enraged."
        },
        "148": {
            "node_name": "Echo Barrier",
            "node_info": "Defender gains an energy barrier with 15 charges. Striking the Defender, applying a Bleed effect, or applying an Armor Break effect removes a charge. The Defender is immune to all damage while the barrier has charges remaining. Charges are restored to 15 every 0 seconds."
        },
        "149": {
            "node_name": "Electric Fluctuations - 1",
            "node_info": "The duration of the Attacker's Buffs is reduced by 1.50 seconds and if they are a Robot they suffer 50% reduced Ability Accuracy."
        },
        "150": {
            "node_name": "Electric Fluctuations - 2",
            "node_info": "The duration of the Attacker's Buffs is reduced by 3.50 seconds and if they are a Robot they suffer 60% reduced Ability Accuracy."
        },
        "151": {
            "node_name": "Electric Fluctuations - 3",
            "node_info": "The duration of the Attacker's Buffs is reduced by 5 seconds and if they are a Robot they suffer 70% reduced Ability Accuracy."
        },
        "152": {
            "node_name": "Empathic Lock - 2",
            "node_info": "All Power Lock, Heal Block and Fate Seal Debuffs are automatically shared with the Attacker for 7 seconds. Attacker begins the fight with these 3 Debuffs for 15 seconds."
        },
        "153": {
            "node_name": "Empowered Immunity",
            "node_info": "Whenever this champion would receive a debuff they are immune to, they generate 30% of a Bar of Power."
        },
        "154": {
            "node_name": "Encroaching Stun",
            "node_info": "Every 20 seconds the Attacker becomes Stunned for 3 seconds, unless they are performing a Special Attack when the timer expires. During the Stun, the Attacker's Armor Rating is doubled."
        },
        "155": {
            "node_name": "Energize",
            "node_info": "Increase the Defender's Combat Power Rate by 50%. Combat Power is the Power gained by landing hits or being attacked by the Opponent."
        },
        "156": {
            "node_name": "Energize 1",
            "node_info": "Increase the Defender's Combat Power Rate by 100%. This is the Power that is gained by landing hits or being struck by the opponent."
        },
        "157": {
            "node_name": "Energize 2",
            "node_info": "Increase the Defender's Combat Power Rate by 200%. This is the Power that is gained by landing hits or being struck by the opponent."
        },
        "158": {
            "node_name": "Energy Adoption: Fire - 2",
            "node_info": "The Defender has a 50% chance to inflict the Attacker with Incinerate on contact. These effects will not trigger while the Defender is suffering from a Bleed Debuff. The Defender also takes 100% reduced damage from Incinerate effects and gains a Regeneration Buff healing 1% of max health per second until the Incinerate expires."
        },
        "159": {
            "node_name": "Energy Adoption: Ice - 2",
            "node_info": "The Defender has a 50% chance to inflict the Attacker with Coldsnap each time the Defender is struck or the Attacker blocks an attack. These effects will not trigger while the Defender is suffering from an Armor Break Debuff. The Defender also takes 100% reduced damage from Coldsnap effects and gains a Regeneration Buff healing 1% of max health per second until the Coldsnap expires."
        },
        "160": {
            "node_name": "Energy Adoption: Lightning - 2",
            "node_info": "The Defender has a 50% chance to inflict the Attacker with Shock on contact. These effects will not trigger while the Defender is suffering from a Poison Debuff. The Defender also takes 100% reduced damage from Shock effects and gains a Regeneration Buff healing 1% of max health per second until the Shock expires."
        },
        "161": {
            "node_name": "Energy Conduit",
            "node_info": "Start the fight with +2 Prowess and +8% Power."
        },
        "162": {
            "node_name": "Energy Resistance 10%",
            "node_info": "+10% Energy Resistance"
        },
        "163": {
            "node_name": "Energy Sensitive",
            "node_info": "Captain Marvel generates 2 additional Energy Charges when she Blocks, is Struck, or Activates Special Attack 1."
        },
        "164": {
            "node_name": "Engineered Fracture",
            "node_info": "Whenever a Tech Attacker inflicts the Defender with an Armor Break debuff, the Defender is also inflicted with a Passive Heal Block for 10 seconds."
        },
        "165": {
            "node_name": "Enhanced Abilities",
            "node_info": "All abilities trigger 20% more often."
        },
        "166": {
            "node_name": "Enhanced Armor Break",
            "node_info": "Armor Break abilities are 40% more effective."
        },
        "167": {
            "node_name": "Enhanced Armor Up",
            "node_info": "Armor Up abilities are 40% more effective."
        },
        "168": {
            "node_name": "Enhanced Bleed 40%",
            "node_info": "Bleed abilities are 40% more effective."
        },
        "169": {
            "node_name": "Enhanced Critical Buffs",
            "node_info": "Critical Rate and Damage abilities are 40% more effective."
        },
        "170": {
            "node_name": "Enhanced Crits",
            "node_info": "+40% Critical Rate and Damage."
        },
        "171": {
            "node_name": "Enhanced Energy Attacks",
            "node_info": "Energy Attacks inflict 40% more damage."
        },
        "172": {
            "node_name": "Enhanced Force Field",
            "node_info": "Force Field charges can only be removed from Unblockable or Heavy Attacks."
        },
        "173": {
            "node_name": "Enhanced Fury",
            "node_info": "Fury abilities are 40% more effective."
        },
        "174": {
            "node_name": "Enhanced Incinerate",
            "node_info": "Incinerate abilities are 40% more effective."
        },
        "175": {
            "node_name": "Enhanced Parry - Armor Break",
            "node_info": "After a successful Parry by the Attacker, the Defender gains an Armor Break Debuff, reducing Armor Rating by 1000 for 15 seconds. Does not stack."
        },
        "176": {
            "node_name": "Enhanced Poison",
            "node_info": "Poison abilities are X% more effective."
        },
        "177": {
            "node_name": "Enhanced Power Drain",
            "node_info": "Abilities that burn, drain or steal Power are 80% more effective."
        },
        "178": {
            "node_name": "Enhanced Precision",
            "node_info": "Precision abilities are +X% more effective."
        },
        "179": {
            "node_name": "Enhanced Shock - 40%",
            "node_info": "Shock abilities are 40% more effective."
        },
        "180": {
            "node_name": "Enhanced Special 1",
            "node_info": "Special 1 deals 30% more damage and the first melee hit or instant projectile hit, such as that from a beam or psychic blast, is Unblockable. Projectiles with flight time, such as an arrow or rock, are not Unblockable."
        },
        "181": {
            "node_name": "Enhanced Special 2",
            "node_info": "Special 2 deals 20% more damage and the first melee hit or instant projectile hit, such as that from a beam or psychic blast, is Unblockable. Projectiles with flight time, such as an arrow or rock, are not Unblockable."
        },
        "182": {
            "node_name": "Enhanced Special 3",
            "node_info": "Special 3 deals 10% more damage."
        },
        "183": {
            "node_name": "Enhanced Visibility",
            "node_info": "While Mysterio's helmet is active all Power gained from landing or receiving attacks is increased by 50%."
        },
        "184": {
            "node_name": "Enhanced Weakening",
            "node_info": "Weakness and Fatigue abilities are 40% more effective."
        },
        "185": {
            "node_name": "Ensnare Tech",
            "node_info": "Tech attackers are blasted by 4000 Cosmic True Damage and suffer -100% Ability Accuracy."
        },
        "186": {
            "node_name": "Escalation",
            "node_info": "The Defender gains a Fury passive every second increasing Base Attack by 5% per stack."
        },
        "187": {
            "node_name": "Explosive Personality",
            "node_info": "When the Defender blocks an attack, they activate an Armor Up Buff, boosting Armor by 25%. Upon reaching 5 stacks of Armor Up generated by Explosive Personality, Armor Up stacks explode and remove 25% of the Attacker's Max Health."
        },
        "188": {
            "node_name": "Extend",
            "node_info": "The Defender's Buffs and Debuffs inflicted last X% longer."
        },
        "189": {
            "node_name": "Extinction Protocol",
            "node_info": "The inevitable extinction protocol grants the Defender up to +200% Attack based on how full the Attacker's Power Bar is. Each time the Defender activates a Special Attack, their Power Rate increases by 15% for the remainder of the fight."
        },
        "190": {
            "node_name": "Extrasensory",
            "node_info": "Professor X gains +1 additional Channeling Charge(s) per second for each bar of Power the Attacker has."
        },
        "191": {
            "node_name": "Failure to Launch - 2",
            "node_info": "Whenever the Defender fails to Evade while the Attacker has a True Strike or True Accuracy effect, the Defender gains 20% of a Bar of Power over 1 second(s). Skill attackers do not trigger this."
        },
        "192": {
            "node_name": "Fair is Fair - 1",
            "node_info": "Whenever one of the Defender's Buffs is Nullified the Attacker is Power Locked for 2.50 seconds."
        },
        "193": {
            "node_name": "Faltering Mind",
            "node_info": "Falter Effects inflicted by this Defender last for 1 additional second and reduce the Attacker's Defensive Ability Accuracy by 100%."
        },
        "194": {
            "node_name": "Fearless",
            "node_info": "70% chance to Purify Debuffs and instantly Regenerate 4% Health per Debuff if Vibranium Armor is active."
        },
        "195": {
            "node_name": "Feat of Energy 2",
            "node_info": "When the Attacker reaches 2 Bars of Power, the Defender gains a Power Gain Buff granting 100% of a Bar of Power over 4 seconds."
        },
        "196": {
            "node_name": "Feat of Energy 3",
            "node_info": "When the Attacker reaches 3 Bars of Power, the Defender gains a Power Gain Buff granting 100% of a Bar of Power over 4 seconds."
        },
        "197": {
            "node_name": "Feat of Indestructible 1",
            "node_info": "When the Attacker reaches 1 Bar of Power, the Defender gains a Indestructible Buff causing them to ignore all damage for 5 seconds."
        },
        "198": {
            "node_name": "Feat of Indestructible 2",
            "node_info": "When the Attacker reaches 2 Bars of Power, the Defender gains a Indestructible Buff causing them to ignore all damage for 5 seconds."
        },
        "199": {
            "node_name": "Feat of Indestructible 3",
            "node_info": "When the Attacker reaches 3 Bars of Power, the Defender gains a Indestructible Buff causing them to ignore all damage for 5 seconds."
        },
        "200": {
            "node_name": "Feat of Vigilance 1",
            "node_info": "When the Attacker reaches 1 Bar of Power, the Defender gains a Vigilance Buff preventing their attacks from Missing for 10 seconds."
        },
        "201": {
            "node_name": "Feat of Vigilance 2",
            "node_info": "When the Attacker reaches 2 Bars of Power, the Defender gains a Vigilance Buff preventing their attacks from missing for 10 seconds."
        },
        "202": {
            "node_name": "Feats of Power",
            "node_info": "When above 1 Bar of Power, gain a Fury Buff. When above 2 Bars of Power, gain a Precision Buff. When at 3 Bars of Power, gain a Cruelty Buff."
        },
        "203": {
            "node_name": "Fight or Flight",
            "node_info": "Every 12 seconds, the Defender gains an Unstoppable Buff for 4 seconds. If the Attacker is far away from the Defender when this triggers, the Attacker gains Unstoppable instead."
        },
        "204": {
            "node_name": "Finish Them",
            "node_info": "While the Attacker is suffering from a Damage Over Time effect this Defender is more likely to activate Special Attacks."
        },
        "205": {
            "node_name": "Finisher",
            "node_info": "All Special Attacks dealt and received have their damage increased by 2.5% for each hit on the Attacker's Combo Meter."
        },
        "206": {
            "node_name": "Fire of Hades",
            "node_info": "At the start of the fight and every 30 seconds, Mephisto activates his Aura of Incineration for 10 seconds."
        },
        "207": {
            "node_name": "Fissure",
            "node_info": "Each of the Defender's attacks tears and ruptures the Attacker's Armor, inflicting a stacking X% Armor Break."
        },
        "208": {
            "node_name": "Fisticuffs - 1",
            "node_info": "Neither Champion can activate Buffs or Debuffs for the first 10 seconds of the fight."
        },
        "209": {
            "node_name": "Fisticuffs - 2",
            "node_info": "Neither Champion can activate Buffs or Debuffs for the first 20 seconds of the fight."
        },
        "210": {
            "node_name": "Fisticuffs - 3",
            "node_info": "Neither Champion can activate Buffs or Debuffs for the first 30 seconds of the fight."
        },
        "211": {
            "node_name": "Flare",
            "node_info": "The Opponent gains +X% Attack, but Degenerates X% of their Max Health over X seconds. The strength of the Degeneration is affected by Class Relationships."
        },
        "212": {
            "node_name": "Flux Dispersal",
            "node_info": "Each time the Defender is Struck they gain a Dispersal Charge, which reduces all Damage taken from Hits by 5%. Being Struck by a Heavy Attack removes all charges."
        },
        "213": {
            "node_name": "Footloose",
            "node_info": "After activating a Special Attack, the Defender becomes Unstoppable and has a 25% chance to Evade incoming attacks for 7 seconds."
        },
        "214": {
            "node_name": "Force of Will",
            "node_info": "The Defender is Immune to Ability Accuracy Modification."
        },
        "215": {
            "node_name": "Forced Field",
            "node_info": "While the Force Field is active, Invisible Woman fights more defensively. While it is inactive, she fights more aggressively."
        },
        "216": {
            "node_name": "Foresight",
            "node_info": "Intercepting the opponent's Dash Attack with a Basic Attack grants the Attacker a Passive Fury charge, increasing their Attack Rating by 200% for 5 seconds."
        },
        "217": {
            "node_name": "Freezer Burn",
            "node_info": "When striking the Defender, the Attacker has a 20% chance to be inflicted with an Incinerate Debuff, dealing 100% of the Defender's current Attack as direct damage over 5 seconds. When striking the Defender's Block, the Attacker has a 20% chance to be inflicted with an Coldsnap Debuff, dealing 100% of the Defender's current Attack as direct damage over 5 seconds."
        },
        "218": {
            "node_name": "Friend From Work",
            "node_info": "+60% Attack when Thunder God's Wrath is active."
        },
        "219": {
            "node_name": "Fundamentals",
            "node_info": "The Defender has a -X% chance to use Special Attacks, instead they gain a bonus based on their Current Power: Less than 1 Bar: Reduce all incoming Damage by X%. 1 Bar: Gain +X Block Penetration. 2 Bars: All Attacks are Unblockable. 3 Bars: All Attacks are Unblockable and Charging a Heavy Attack deals X% of the Defender's Attack as Direct Physical Damage."
        },
        "220": {
            "node_name": "Fury",
            "node_info": "A X% chance to gain Fury, boosting Attack by X% for X seconds."
        },
        "221": {
            "node_name": "Galactic Intervention - 1",
            "node_info": "Terrax gains an additional Attack Charge whenever he would gain one."
        },
        "222": {
            "node_name": "Gambler's Fate",
            "node_info": "Both Champions gain a random effect at the start of the match."
        },
        "223": {
            "node_name": "Gassed",
            "node_info": "While under the effects of a Fatigue Debuff, 10% of the Attacker's Power is Drained every Second. Additionally, they suffer 25% of the Defender's Attack as Damage each time they land a hit."
        },
        "224": {
            "node_name": "Gauss Warp",
            "node_info": "Each time the Defender is Struck they gain a Gauss Charge, increasing their Block Proficiency by 5%. 1 Gauss Charge is removed each second while they are afflicted with a Shock Debuff."
        },
        "225": {
            "node_name": "Genetic Memory",
            "node_info": "Grant permanent effects from a genetic memory. Maximum X effects."
        },
        "226": {
            "node_name": "Genetic Perfection",
            "node_info": "Mister Sinister begins the fight with 3 random Passive Effects from his Signature Ability."
        },
        "227": {
            "node_name": "Genetic Recalibration",
            "node_info": "#Symbiote Attackers that Dash Back and Hold Block for 1 second consume all available Mitosis Buffs into a Genetic Calibration effect for 1 second per Buff consumed. Genetic Calibration reduces Defender ability acuracy by 1000%, and increases Attacker buff duration by 100%, and Heavy Attack damage by 500%."
        },
        "228": {
            "node_name": "Genius",
            "node_info": "While benefitting from at least 1 Armor Up Buff, #Villain Attackers will Passively Burn 10% of the Defender's Max Power on each Hit, dealing Direct Damage based on the Power Burned."
        },
        "229": {
            "node_name": "Gimme",
            "node_info": "Whenever the Attacker Regenerates health, the Defender is dealt direct damage equal to X% of the Health gained, but the Defender takes X% less damage from all other sources and is immune to Damage Over Time effects."
        },
        "230": {
            "node_name": "Godslayer",
            "node_info": "Special Attacks benefit from 50% increased Critical Hit Damage."
        },
        "231": {
            "node_name": "Got a Light?",
            "node_info": "Both the Attacker and Defender's strikes have a 20% chance to apply an Incinerate Debuff, dealing 0.5 Energy Damage over 10 seconds."
        },
        "232": {
            "node_name": "Great Power",
            "node_info": "Upon reaching 3 Responsibility #Spiderverse Champions convert them into a Great Power Buff lasting 10 seconds, making their attacks Ignore Armor and Resistances, and Unblockable. You cannot gain Responsibility while you have Great Power."
        },
        "233": {
            "node_name": "Great Power Comes Great Utility",
            "node_info": "Spider-Man (Stealh Suit) starts the fight loaded with a different Web Cartridge depending on the Opponent."
        },
        "234": {
            "node_name": "Great Responsibility",
            "node_info": "Each Hit that a #Spiderverse Champion avoids from this Defender's Special Attacks with Miss, Evade, or Dexterity grants them an indefinite Responsibility Passive."
        },
        "235": {
            "node_name": "Gripped by Fear",
            "node_info": "When charging Heavy Attacks, Void can gain up to X Fury Buffs, each enhancing his Attack Rating by X% for X seconds."
        },
        "236": {
            "node_name": "Haazareth Rage",
            "node_info": "While the Aura of Haazareth is active this defender is more likely to activate Special Attack 2."
        },
        "237": {
            "node_name": "Haazareth Vengeance",
            "node_info": "Whenever the Defender is knocked down the have a X% chance to activate the Aura of Haazareth for X seconds."
        },
        "238": {
            "node_name": "Handicap Match",
            "node_info": "Special Attacks, Critical Hits, and Damage over time effects do 50% less damage to the Defender."
        },
        "239": {
            "node_name": "Hard Head",
            "node_info": "If the Attacker attempts to Stun the Defender, the Stun is reflected back onto the Attacker for 2.5 seconds. This ability will then go into cooldown for 7 seconds, before coming back."
        },
        "240": {
            "node_name": "Hard Knock Life - 2",
            "node_info": "Every time the Attacker performs a successful Well Timed Block, they gain a Passive Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 10% for 15 seconds."
        },
        "241": {
            "node_name": "Hard Knock Life - 3",
            "node_info": "Every time the Attacker performs a successful Well Timed Block, they gain a Passive Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 15% for 15 seconds."
        },
        "242": {
            "node_name": "Heal Block",
            "node_info": "Prevent the Attacker from recovering Health."
        },
        "243": {
            "node_name": "Heal Block (Debuff)",
            "node_info": "The Attacker is permanently affected by a Heal Block Debuff."
        },
        "244": {
            "node_name": "Heal Block (Special Attacks)",
            "node_info": "The Defender's Special Attacks inflict Heal Block, preventing the Attacker from recovering Health for X seconds."
        },
        "245": {
            "node_name": "Heal Block - Passive",
            "node_info": "The Attacker is permanently affected by a Passive Heal Block."
        },
        "246": {
            "node_name": "Heal Prevention",
            "node_info": "The Attacker is unable to Heal through any means."
        },
        "247": {
            "node_name": "Heal or Hide",
            "node_info": "Every 12 seconds, the Defender gains a Regeneration Buff restoring 10% of their Max Health over 5 seconds. If the Attacker is far away from the Defender when this triggers, the Attacker gains Regeneration instead."
        },
        "248": {
            "node_name": "Health",
            "node_info": "+X% Health"
        },
        "249": {
            "node_name": "Healthy Balance",
            "node_info": "The Attacker can inflict up to 5 Heal Block effects after which the Defender becomes Immune to Heal Block."
        },
        "250": {
            "node_name": "Heart Attack",
            "node_info": "While Pure fo Heart is active Longshot becomes more aggressive. While Pure of Heart is inactive Longshot becomes more defensive."
        },
        "251": {
            "node_name": "Heavy Assault",
            "node_info": "Both Champion's Attack is increased by 500% when using a Heavy Attack. While charging a Heavy Attack, this Defender is Unstoppable."
        },
        "252": {
            "node_name": "Heavy-Handed",
            "node_info": "Special Damage increased based on Armor."
        },
        "253": {
            "node_name": "Heavy-Hitter",
            "node_info": "Heavy Attacks are not interrupted."
        },
        "254": {
            "node_name": "Henchman",
            "node_info": "When triggering a Fury Buff #Villain Attackers will Passively Purify all Debuffs"
        },
        "255": {
            "node_name": "Highly Flammable",
            "node_info": "Incinerates caused by the Attacker deal 200% more damage."
        },
        "256": {
            "node_name": "Hit Me, I Dare You",
            "node_info": "When Struck the Defender gains a Chitin Charge. At 50 all Charges are Removed and the Defender gains an Armor Up Buff increasing Armor by 30% lasting X seconds."
        },
        "257": {
            "node_name": "Honed Radar Sense",
            "node_info": "Daredevil's training in this environment has reached 100% perfect Radar Sense"
        },
        "258": {
            "node_name": "Hot Blooded",
            "node_info": "While Human Torch is Bleeding, his Temperate increases. Whenever a Bleed expires, he gains a Smoulder Passive."
        },
        "259": {
            "node_name": "Hot and Bothered",
            "node_info": "Defensive Ability Accuracy is lowered by 80% while under the effects of Incinerate."
        },
        "260": {
            "node_name": "Hurt Locker",
            "node_info": "Using the same type of Special Attack twice in a row gives the Attacker a Delayed Blast charge for 5 seconds which may be removed by landing a Heavy Attack. If the Blast expires, the Attacker takes 50% of their Health as direct damage."
        },
        "261": {
            "node_name": "ISO-Corruption",
            "node_info": "-50% Attack and Health"
        },
        "262": {
            "node_name": "Icarus",
            "node_info": "When the Defender is struck by an attack or stunned by a parry, the Attacker gains a Fury Buff granting 10% Attack Rating for 10 seconds. If the Attacker gains more than 8 Fury Buffs in this way or one of these Fury Buffs expires, the Attacker is inflicted with a Degeneration effect dealing 100% of the Defender's attack over 4 seconds. If the Attacker lands a Heavy Attack their Fury Buffs are removed with no penalty."
        },
        "263": {
            "node_name": "Imminent Clairvoyance",
            "node_info": "Every 3 seconds the Defender gains a Claivoyance Charge."
        },
        "264": {
            "node_name": "Immunity",
            "node_info": "Immune to Debuff effects."
        },
        "265": {
            "node_name": "Immunity (Bleed)",
            "node_info": "Immune to Bleed."
        },
        "266": {
            "node_name": "Immunity (Poison)",
            "node_info": "Immune to Poison."
        },
        "267": {
            "node_name": "Impart",
            "node_info": "At the start of the fight, Ultron gains a random deactivated Fury, Armor Up, Power Gain or Regeneration Buff that will change every 7.50 seconds. When the opponent inflicts a Debuff, Ultron activates or refreshes the current Buff."
        },
        "268": {
            "node_name": "Improved Power Gain 100%",
            "node_info": "Increases all Power this Defender receives from Power Gain Effects by 100%."
        },
        "269": {
            "node_name": "Incinerate 30",
            "node_info": "Inflicts Incinerate damage on the Attacker, draining 100% health over 30 seconds. This ability has +100% flat Ability Accuracy."
        },
        "270": {
            "node_name": "Incinerate 60",
            "node_info": "Inflicts Incinerate damage on the Attacker, draining 100% health over 60 seconds. This ability has +100% flat Ability Accuracy."
        },
        "271": {
            "node_name": "Indomitable",
            "node_info": "Whenever the Defender's healing abilities would be reversed, they are instead only Heal Blocked."
        },
        "272": {
            "node_name": "Infectious Wrath",
            "node_info": "Tech Attackers gain an indefinite Passive Fury increasing Attack Rating by 35% whenever the Defender tries to gain health while Heal Blocked. Max stacks 10. Gaining a Fury in this way has a 1 second cooldown."
        },
        "273": {
            "node_name": "Infinity Blast",
            "node_info": "Blasts a portion of remaining Health. Effectiveness changes to match the Class Relationship of both Champions."
        },
        "274": {
            "node_name": "Insecurity",
            "node_info": "Whenever Taunt Debuff is applied on the Attacker, it drains 50% of their power over 3 seconds."
        },
        "275": {
            "node_name": "Intervention: Concussion Passive: 5",
            "node_info": "If the Attacker reaches 5 Stacks of Intervention they convert into Passive Concussion reducing Ability Accuracy by 100%."
        },
        "276": {
            "node_name": "Intervention: Villainous",
            "node_info": "When a #Villain Attacker knocks down the Defender they have 100% chance to apply a Passive Intervention on the Attacker."
        },
        "277": {
            "node_name": "Intervention: Withdraw: SP3",
            "node_info": "Any Hit from the Attacker's Special Attack 3 removes all Interventions, and any of their converted effects from both Champions."
        },
        "278": {
            "node_name": "Invade",
            "node_info": "Both Champions have 100% Block Penetration and 300% increased Attack when hitting a Block."
        },
        "279": {
            "node_name": "Inverted Immunity (Bleed) 1",
            "node_info": "The Attacker receives a Bleed Debuff every X seconds, dealing 0 damage. If this Debuff is removed or prevented from activating, the Attacker instead loses X% of their Max Health instantly."
        },
        "280": {
            "node_name": "Ionized Armor - 1",
            "node_info": "When the Defender finishes a Special Attack, they gain an indefinite Armor Up Buff granting +5% Armor."
        },
        "281": {
            "node_name": "Iso-Infused",
            "node_info": "+X% Attack and Health"
        },
        "282": {
            "node_name": "Juke",
            "node_info": "Finishing a 5-hit combo with a Light or Medium Attack grants the Attacker a Passive Fury charge, increasing their Attack Rating by 7% per charge. Up to 10 charges can be gained and all charges are lost when performing the same combo-ender twice in a row."
        },
        "283": {
            "node_name": "K-Meyeke",
            "node_info": "The most effective champion brought into this fight gets a Passive +200% Fury."
        },
        "284": {
            "node_name": "Kinetic Brewing",
            "node_info": "Each time he is struck, Diablo has a 25% chance to Brew a Concoction or drink it if one is ready. His Concoctions also gain +40% duration."
        },
        "285": {
            "node_name": "Kinetic Instigator",
            "node_info": "The Opponent generates Power when striking this Champion's Block."
        },
        "286": {
            "node_name": "Kinetic Reactor",
            "node_info": "This enemy generates Power when striking a Blocking target."
        },
        "287": {
            "node_name": "Kinetic Transference - 1",
            "node_info": "Blocked attacks cause the Defender to gain 5% Power. If the Blocked attack dealt 0 damage, the amount of Power gained is doubled."
        },
        "288": {
            "node_name": "Kinetic Transference - 2",
            "node_info": "Blocked attacks cause the Defender to gain 7.50% Power. If the Blocked attack dealt 0 damage, the amount of Power gained is doubled."
        },
        "289": {
            "node_name": "Kinetic Transference - 3",
            "node_info": "Blocked attacks cause the Defender to gain 10% Power. If the Blocked attack dealt 0 damage, the amount of Power gained is doubled."
        },
        "290": {
            "node_name": "Knock-Out!",
            "node_info": "Stunning this Defender for 10 seconds straight or reaching a combo of 300 will instantly defeat them."
        },
        "291": {
            "node_name": "Languor",
            "node_info": "Whenever Power empties to zero, suffer X% of this Champion's Attack as Direct Damage."
        },
        "292": {
            "node_name": "Lazarus",
            "node_info": "The Defender begins the fight with X revival charges, which heal them for X% max Health whenever they would be knocked out. Every X Hits on the Attacker's Combo Meter removes X of these charges. When the Attacker loses a combo, the Defender gains a revival charge."
        },
        "293": {
            "node_name": "Life Transfer",
            "node_info": "The Opponent suffers a permanent Degeneration effect losing 2% of their Max Health per second, but Lifestealing 125% of their Damage done. The Lifesteal percentage is affected by Class Relationships."
        },
        "294": {
            "node_name": "Lifecycle",
            "node_info": "The Defender is immune to damage from debuffs and has a shield that prevents them from being knocked out. If the shield is not already disabled, knocking down the Defender disables it for 0.50 seconds. Each time the shield is disabled its downtime is increased by 0.50 seconds up to a maximum of 3.50 seconds. Every hit that would knock the Defender out while the shield is active heals 10% of their max health."
        },
        "295": {
            "node_name": "Like Old Days",
            "node_info": "40% chance to activate a Combo Shield for 5 seconds when Struck."
        },
        "296": {
            "node_name": "Limber 20%",
            "node_info": "Each time the Defender receives a Stun Debuff, they reduce the Duration of further Stun Debuffs by 20%."
        },
        "297": {
            "node_name": "Limber (seconds)",
            "node_info": "Each time the Defender receives a Stun Debuff, they reduce the Duration of further Stun Debuffs by X seconds."
        },
        "298": {
            "node_name": "Limited Immunity - 1",
            "node_info": "Defender is Immune to all Debuffs for the first 10 seconds of the fight."
        },
        "299": {
            "node_name": "Limited Immunity - 2",
            "node_info": "Defender is Immune to all Debuffs for the first 18 seconds of the fight."
        },
        "300": {
            "node_name": "Limited Immunity - 3",
            "node_info": "Defender is Immune to all Debuffs for the first 25 seconds of the fight."
        },
        "301": {
            "node_name": "Linked Boost",
            "node_info": "Shielded by nearby Linked Nodes."
        },
        "302": {
            "node_name": "Little League",
            "node_info": "This Defender takes X% more damage against Small and Medium Champions and inflicts X% more damage against Large and Extra Large Champions."
        },
        "303": {
            "node_name": "Long Distance Relationship",
            "node_info": "While close to the Defender, the Attacker gains a Weakness Debuffs every 3 seconds, reducing their attack by 10% permanently. Staying away from the Defender causes these Weakness effects to gradually fall off."
        },
        "304": {
            "node_name": "Lullaby",
            "node_info": "When Struck, Hulk has a X% chance to ready a SMASH for his next attack."
        },
        "305": {
            "node_name": "Lunatic",
            "node_info": "During a Full Moon, the benefits of all Lunar Phases are applied to Moon Knight."
        },
        "306": {
            "node_name": "Madness",
            "node_info": "When triggering an Armor Break Debufff #Villain Attackers will also apply a Passive Powerlock to the Defender which will last until the last Armor Break ends."
        },
        "307": {
            "node_name": "Major League",
            "node_info": "The Defender takes X% more damage from Large and Extra Large Champions and inflicts X% more damage to Small and Medium Champions."
        },
        "308": {
            "node_name": "Mark of the Labyrinth",
            "node_info": "A chance to Stun opponents on attacks. A chance to Evade when attacked. A third Special Attack has been activated! Opponents can only do up to 50,000 damage in a single attack. At the start of the fight, Attack is increased the lower the opponent's Health."
        },
        "309": {
            "node_name": "Martial Mastery",
            "node_info": "Every X hits inflict Stun."
        },
        "310": {
            "node_name": "Masochism",
            "node_info": "Every 7 seconds the next Debuff triggered on this Champion is immediately removed. Each time this effect triggers they Regenerate 5% of their Max Health."
        },
        "311": {
            "node_name": "Master of the Sword",
            "node_info": "If Morningstar has less than 2 Souls she gains 1."
        },
        "312": {
            "node_name": "Mastermind",
            "node_info": "#Villain Attackers increase the duration of Bleed, Incinerate, and Shock Debuffs on their Opponent by 100%"
        },
        "313": {
            "node_name": "Matador",
            "node_info": "The Attacker gains 1 Bar of Power every time the Defender Activates a Special Attack. This is the only way the Attacker can gain Power in this fight."
        },
        "314": {
            "node_name": "Maximum Overdrive",
            "node_info": "When Punisher 2099's Battery reaches intervals of exactly 25%, he gains 25% of his Max Power over 5 seconds."
        },
        "315": {
            "node_name": "Mesmerize",
            "node_info": "A 7% chance to Evade attacks and leave the attacker Stunned for 1 second(s)."
        },
        "316": {
            "node_name": "Micro-Reflect",
            "node_info": "When this Defender Glances an attack, a portion of the damage is reflected on the Attacker."
        },
        "317": {
            "node_name": "Mighty Charge - 1",
            "node_info": "While performing a Medium dash attack, Defender is immune to Debuffs."
        },
        "318": {
            "node_name": "Mighty Charge - 2",
            "node_info": "While performing a Medium dash attack, Defender is immune to Debuffs and Unstoppable."
        },
        "319": {
            "node_name": "Mighty Charge - 3",
            "node_info": "While performing a Medium dash attack, Defender is immune to Debuffs, Unstoppable and gains +200% Attack."
        },
        "320": {
            "node_name": "Mind's Eye",
            "node_info": "Skill Attackers gain an indefinite Passive Fury increasing Attack Rating by 35% each time the Defender's Evade effect is prevented in any way other than Ability Accuracy reduction. Max stacks 10."
        },
        "321": {
            "node_name": "Mirror Image",
            "node_info": "Every 7 seconds, automatically mirrors all Cruelty, Precision, Resistance, Fury, Armor Up and Regeneration Buffs for 6 seconds."
        },
        "322": {
            "node_name": "Missing in Action 1",
            "node_info": "Whenever a Buff on the Defender expires, if the Attacker lands a Heavy or Special Attack within 5 seconds the Defender is Faltered for 3 seconds, otherwise, the Attacker is. Faltered Champions have 100% chance for their attacks to miss."
        },
        "323": {
            "node_name": "Mitosis",
            "node_info": "Hits on this Defender grant #Symbiote Attackers an indefinite Mistosis Buff. Max Stacks: 10"
        },
        "324": {
            "node_name": "Mix Master",
            "node_info": "If the Attacker attempts the same Basic Attack twice in a row the Defender has a 100% chance to Evade the second Attack."
        },
        "325": {
            "node_name": "Monster Moshpit - 2",
            "node_info": "Mole Man gains a Monster Mass every 7 seconds. Intercepting Mole Man removes all Monster Mass."
        },
        "326": {
            "node_name": "Monster Moshpit - 3",
            "node_info": "Mole Man gains a Monster Mass every 5 seconds. Intercepting Mole Man removes all Monster Mass."
        },
        "327": {
            "node_name": "Mostly Average Joes",
            "node_info": "If Taskmaster's Current Exploit Weakness target attack is a Special Attack all his Special Attacks become Unblockable."
        },
        "328": {
            "node_name": "Mutant Pursuit",
            "node_info": "Reduces opponent's Attack with Specials by X% when facing a target of the Mutant Class."
        },
        "329": {
            "node_name": "Mutant Wrath",
            "node_info": "All Mutant Champions in this Arena receive Fury for the length of the fight, raising Attack by X%."
        },
        "330": {
            "node_name": "Mystic Conditioning 1",
            "node_info": "Whenever the Attacker attempts to remove a Buff with a Nullify, Fate Seal, or Stagger, the chances of all future Nullify, Fate Seal and Stagger effects is reduced by 10%."
        },
        "331": {
            "node_name": "Mystic Conditioning 3",
            "node_info": "Whenever the Attacker attempts to remove a Buff with a Nullify, Fate Seal, or Stagger, the chances of all future Nullify, Fate Seal and Stagger effects is reduced by 20%."
        },
        "332": {
            "node_name": "Mystic Observation",
            "node_info": "Reduces the duration of the target's Power Lock effects by X% and generate X% Power each time a Power Lock expires when facing a target of the Mystic Class."
        },
        "333": {
            "node_name": "Mystic Ward - 1",
            "node_info": "Enemy Nullify effects have a 65% chance to fail."
        },
        "334": {
            "node_name": "Nanite Healing",
            "node_info": "Every 15 seconds, the Defender Passively Regenerates 10% of their Max Health over 8 seconds."
        },
        "335": {
            "node_name": "Nano-Plague",
            "node_info": "Whenever a Robotic Attacker would gain a Poison Debuff, they instead gain Shock which deals X% of the Defender's attack as direct damage over X seconds."
        },
        "336": {
            "node_name": "No Hit-M...ercy 1",
            "node_info": "Each time the Defender is knocked down they gain a Cruelty Buff granting +350% Critical Damage Rating for 5 seconds. While the Defender has a Cruelty Buff, they can strike with Critical Hits even while the Opponent is blocking."
        },
        "337": {
            "node_name": "No Hit-M...ercy 3",
            "node_info": "Each time the Defender is knocked down they gain a Cruelty Buff granting +350% Critical Damage Rating for 10 seconds. While the Defender has a Cruelty Buff, they can strike with Critical Hits even while the Opponent is blocking."
        },
        "338": {
            "node_name": "No Loose Ends",
            "node_info": "Elektra's Signature Ability is enhanced against enemies with 50% or less remaining Health."
        },
        "339": {
            "node_name": "No Mercy",
            "node_info": "Inflicting a Debuff reduces opponent's Ability Accuracy by 100% for 0.7 seconds."
        },
        "340": {
            "node_name": "No Retreat!",
            "node_info": "When the Attacker dashes back, they gain Degen Timer for 1.20 seconds. Dashing back again while the Degen Timer is active causes a Passive Degen, dealing 200% of the Defender's Attack as direct damage over 5 seconds."
        },
        "341": {
            "node_name": "No Use in Hiding",
            "node_info": "Professor X becomes more aggressive while the Attacker is Mind Controlled."
        },
        "342": {
            "node_name": "Not Afraid of Death",
            "node_info": "Regenerates 10% Health when killing opponents."
        },
        "343": {
            "node_name": "Now You See Me - 1",
            "node_info": "Every 10 seconds the Attacker is inflicted with a Falter Debuff giving them a 100% chance to miss for 3 seconds. If the Attacker lands a hit, this timer is reset."
        },
        "344": {
            "node_name": "Now You See Me - 2",
            "node_info": "Every 8 seconds the Attacker is inflicted with a Falter Debuff giving them a 100% chance to miss for 3 seconds. If the Attacker lands a hit, this timer is reset."
        },
        "345": {
            "node_name": "Nullify Countdown - 1",
            "node_info": "Once the Defender Nullifies 7 Buff(s), they gain a Power Gain Buff granting 50% of Max Power over 10 second(s)."
        },
        "346": {
            "node_name": "Nullify Countdown - 2",
            "node_info": "Once the Defender Nullifies 7 Buff(s), they gain a Power Gain Buff granting 75% of Max Power over 10 second(s)."
        },
        "347": {
            "node_name": "Off Limits",
            "node_info": "Hulk's chance to SMASH on All Attacks increases by 400% while Face Me is active."
        },
        "348": {
            "node_name": "One Eye Open",
            "node_info": "100% of the Damage dealt to the Defender while they are stunned is dealt back to the Attacker."
        },
        "349": {
            "node_name": "Opportunist - 1",
            "node_info": "This Defender gains +10% Attack for each Buff on them."
        },
        "350": {
            "node_name": "Opportunist - 2",
            "node_info": "This Defender gains +25% Attack for each Buff on them."
        },
        "351": {
            "node_name": "Opportunist - 3",
            "node_info": "This Defender gains +50% Attack for each Buff on them."
        },
        "352": {
            "node_name": "Oppression",
            "node_info": "Thanos' Army crushes those without the power of the Stone. Attacking Champions who are not under the effects of an Infinity Stone have their Attack reduced by 80% and Degenerate 100% of their health over 35 Seconds."
        },
        "353": {
            "node_name": "Oppressive Curse",
            "node_info": "When Morningstar is Blocked, she gains a Soul Charge. Slight delay between Oppressive Curse activations."
        },
        "354": {
            "node_name": "Optimist",
            "node_info": "Gains Fury, Armor Up, and Health Steal as long as they remain below 25% HP."
        },
        "355": {
            "node_name": "Oscillate",
            "node_info": "Every X seconds, the Defender alternates between a Fury passive increasing Base Attack by X% and an Armor Up/Crit Resistance passive increasing Armor and Crit Resist by X%."
        },
        "356": {
            "node_name": "Oscillate (Amount)",
            "node_info": "Every X seconds, the Defender alternates between a Fury passive increasing Base Attack by X% and an Armor Up/Crit Resistance passive increasing Armor and Crit Resist by X."
        },
        "357": {
            "node_name": "Other Half",
            "node_info": "After a Special 3 Attack, Sentry inflicts Fear of the Void. Fear of the Void combines Agility, Weakness, and Petrify Debuffs, as well as increasing Sentry's Attack Rating by 50% for 40 seconds."
        },
        "358": {
            "node_name": "Outlast",
            "node_info": "Reduces damage by up to X% proportionate to missing Health."
        },
        "359": {
            "node_name": "Outrageous 2",
            "node_info": "Each time the Attacker gains a bar of Power, Namor decreases the time between generating Outrage by 0.7 second(s)."
        },
        "360": {
            "node_name": "Outrageous 3",
            "node_info": "Each time the Attacker gains a bar of Power, Namor decreases the time between generating Outrage by 0.7 second(s)."
        },
        "361": {
            "node_name": "Overclocked",
            "node_info": "All Champion classes but Tech reduce their Base Attack Rating by 50%."
        },
        "362": {
            "node_name": "Overcoming Fear",
            "node_info": "Fear of the Void activates at the start of the fight for 30 seconds against Avengers."
        },
        "363": {
            "node_name": "Overreach (Fury) - 2",
            "node_info": "While the Attacker has 2 or more Fury Buffs the Defender slowly accumulates power over time and gains +100% Attack. While the Attacker has 0 Fury Buffs Defender gains +20% Ability Accuracy."
        },
        "364": {
            "node_name": "Overreach (Fury) - 3",
            "node_info": "While the Attacker has 2 or more Fury Buffs the Defender slowly accumulates power over time and gains +150% Attack. While the Attacker has 0 Fury Buffs Defender gains +20% Ability Accuracy."
        },
        "365": {
            "node_name": "Parry",
            "node_info": "Well-timed Blocks are more effective, and Stun attackers making contact."
        },
        "366": {
            "node_name": "Particle Protector",
            "node_info": "This Defender has a 35% chance to Glance attacks. Glancing Hits cannot be Critical, deal 50% reduced damage, and suffer -100% Offensive Ability Accuracy."
        },
        "367": {
            "node_name": "Perfect Replication",
            "node_info": "Special Attacks have a 100% chance to copy up to 20 effect(s) at their full duration."
        },
        "368": {
            "node_name": "Perforate",
            "node_info": "Both Champions' Special Attacks are Unblockable."
        },
        "369": {
            "node_name": "Performance Anxiety - 1",
            "node_info": "After the Attacker uses a Special Attack, a 15 second timer is started. If the Attacker activates another Special while this timer is active they are inflicted with a Glancing Debuff for 6 seconds giving their attacks a 100% chance to Glance. Glancing Hits cannot be Critical, deal 50% reduced damage, and suffer -100% Offensive Ability Accuracy."
        },
        "370": {
            "node_name": "Performance Anxiety - 2",
            "node_info": "After the Attacker uses a Special Attack, a 15 second timer is started. If the Attacker activates another Special while this timer is active they are inflicted with a Glancing Debuff for 8 seconds giving their attacks a 100% chance to Glance. Glancing Hits cannot be Critical, deal 50% reduced damage, and suffer -100% Offensive Ability Accuracy."
        },
        "371": {
            "node_name": "Persistent Pressure",
            "node_info": "Defenders under the effect of Unstoppable become Stun Immune, this includes Unstoppable effects triggered outside this node. Every 15 seconds the Defender gains an Unstoppable buff for 5 seconds. The duration of this buff is reduced by 0.5 second(s) for each Prowess Buff or Passive the Attacker has."
        },
        "372": {
            "node_name": "Personal Space - Fury",
            "node_info": "While the Attacker is close to the Defender, the Defender gains a Fury Buff every 3 seconds, increasing their attack by 10% permanently. Staying far away from the Defender causes these Fury effects to gradually fall off."
        },
        "373": {
            "node_name": "Pessimist",
            "node_info": "Gains Fury, Armor Up, and Health Steal as long as they remain above 75% HP."
        },
        "374": {
            "node_name": "Physical Perfection",
            "node_info": "All Champion classes but Skill reduce their Attack by 50%."
        },
        "375": {
            "node_name": "Physical Resistance 20%",
            "node_info": "+20% Physical Resistance"
        },
        "376": {
            "node_name": "Picture of Health",
            "node_info": "The Defender is Immune to Regen Rate Modification."
        },
        "377": {
            "node_name": "Pilfer (Regeneration) - 2",
            "node_info": "Any Buff activated by the Attacker has a 15% chance to be Pilfered, Nullifying the Buff and giving the Defender a burst of 15% Power over 2 seconds. Regeneration buffs have triple the chance to be Pilfered."
        },
        "378": {
            "node_name": "Pilfer (Regeneration) - 3",
            "node_info": "Any Buff activated by the Attacker has a 20% chance to be Pilfered, Nullifying the Buff and giving the Defender a burst of 20% Power over 2 seconds. Regeneration buffs have triple the chance to be Pilfered."
        },
        "379": {
            "node_name": "Plagued Mind",
            "node_info": "Attacker's Power is drained every X seconds."
        },
        "380": {
            "node_name": "Poison",
            "node_info": "Inflicts Poison, draining X% Health over X seconds."
        },
        "381": {
            "node_name": "Poison (Timer)",
            "node_info": "Inflicts Poison every X seconds, dealing X% of this champion's Attack as direct damage over X seconds."
        },
        "382": {
            "node_name": "Poison Vulnerability",
            "node_info": "While the Defender is Poisoned, the Attacker's Attack Rating is increased by 200% when landing an attack."
        },
        "383": {
            "node_name": "Polka Dot Power",
            "node_info": "The Attacker gains no Power from landing or receiving attacks, instead they are granted 12% of a Power Bar per second while the Defender is suffering from a damaging debuff."
        },
        "384": {
            "node_name": "Power Alternator",
            "node_info": "Every X seconds, if the Attacker has more Power than the Defender both Champions are completely Power Drained then granted an amount of Power equal to the amount drained from the opposing Champion."
        },
        "385": {
            "node_name": "Power Axis 1",
            "node_info": "The Attacker gains +60% Combat Power Rate while below 1 Bar(s) of Power, but suffers -60% Combat Power Rate while above."
        },
        "386": {
            "node_name": "Power Bond",
            "node_info": "Attacker's Power draining abilities are 90% less effective."
        },
        "387": {
            "node_name": "Power Drain",
            "node_info": "Special Attacks drain up to 100% Power."
        },
        "388": {
            "node_name": "Power Draw",
            "node_info": "Whenever the Attacker inflicts the Defender with a damaging Debuff, the Attacker is granted a Power Gain Buff increasing Defensive Combat Power Rate by 10% for 10 seconds."
        },
        "389": {
            "node_name": "Power Efficiency",
            "node_info": "The Defender's Special Attacks cost 50% less Power."
        },
        "390": {
            "node_name": "Power Focus",
            "node_info": "The Opponent's Critical Rate is increased by up to X%, based on their current Power."
        },
        "391": {
            "node_name": "Power Focus 1",
            "node_info": "The Defender gains 60% Power Rate while below 1 Bar of Power but suffers -80% Power Rate while above."
        },
        "392": {
            "node_name": "Power Focus 2",
            "node_info": "The Defender gains 60% Power Rate while below 2 Bar of Power but suffers 80% Power Rate while above."
        },
        "393": {
            "node_name": "Power Gain",
            "node_info": "Increase all Power Gain by X%."
        },
        "394": {
            "node_name": "Power Gain Rate Immune",
            "node_info": "The Defender is immune to effects that modify Power Gain Rate, including Petrify."
        },
        "395": {
            "node_name": "Power Lapse - 2",
            "node_info": "Each time the Defender is inflicted with a Power Drain, Power Burn or Power Steal effect they reduce the potency of future effects by 10% for the rest of the fight. This is capped after reaching -100% reduction."
        },
        "396": {
            "node_name": "Power Leak",
            "node_info": "The Defender's Critical Hits have a 50% chance to Power Drain 1 Bar of Power from the Attacker over 6 seconds."
        },
        "397": {
            "node_name": "Power Play - 3",
            "node_info": "Every 12 seconds, whichever Champion has the least amount of Power is Fate Sealed for 6 seconds."
        },
        "398": {
            "node_name": "Power Reserve",
            "node_info": "Special Attacks for both Champions cost 50% less Power."
        },
        "399": {
            "node_name": "Power Seal",
            "node_info": "One touch of the Soul Sword seals the flow of Power in opponents almost permanently."
        },
        "400": {
            "node_name": "Power Shield",
            "node_info": "The Attacker's basic attacks deal no damage, but still generate power, and their Special Attacks deal X% more damage."
        },
        "401": {
            "node_name": "Power Snack - 1",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender gains 25% of a bar of Power."
        },
        "402": {
            "node_name": "Power Snack - 2",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender gains 50% of a bar of Power."
        },
        "403": {
            "node_name": "Power Start 1",
            "node_info": "Start with 1 bar of Power."
        },
        "404": {
            "node_name": "Power Start 2",
            "node_info": "Start with 2 bars of Power."
        },
        "405": {
            "node_name": "Power Sting 3.0",
            "node_info": "Opponents of Yellowjacket face an upgraded Power Sting that lingers forever."
        },
        "406": {
            "node_name": "Power Stone",
            "node_info": "Tryco Slatterus has been gifted the Power Stone by The Grandmaster, granting him new abilities and greatly enhancing his existing ones."
        },
        "407": {
            "node_name": "Power Struggle",
            "node_info": "The Attacker cannot gain Power during the fight through normal means. Each time the Defender reaches a full bar of Power, the Attacker is granted one as well and whenever the Defender launches a Special Attack, the Attacker loses an equal amount of Power."
        },
        "408": {
            "node_name": "Power Technician",
            "node_info": "Tech Attackers under the effect of a Armor Up Buff, Power Drain 2% of the Defender's max Power each time the Attacker blocks an attack. The potency of this drain is increased by 10% for each active Armor Up. Whenever the Defender is Power Drained below a Bar of Power threshold, Tech Attackers gain a permanent Passive Fury, increasing Attack Rating by 15%. Max stacks 20."
        },
        "409": {
            "node_name": "Power Thief - Miss",
            "node_info": "Whenever the Attacker Misses, gain a Power Thief Passive for 10 seconds. While Power Thief is active, all hits steal 5% of the Attacker's current Power."
        },
        "410": {
            "node_name": "Power of Love",
            "node_info": "If under the influence of the Romance Synergy, any reflected stun does not trigger. Each failed stun reflection will grant the Attacker a Permanent Passive Fury, granting 35% Attack Rating."
        },
        "411": {
            "node_name": "Powerful From Afar",
            "node_info": "Each time the Attacker leaves striing distance, the Defender gains a Power Gain Buff. When entering striking disntace the Buff is removed."
        },
        "412": {
            "node_name": "Pressure Gauge - 1",
            "node_info": "The Attacker starts the fight with a Pressure Gauge value of 5. Landing Basic Attacks increases the value by 1 for each hit. Blocking an attack, or activating a Special Attack decreases the value by 1. If the value reaches 0, the Attacker's Power is drained to 0. If the value reaches 10, the Attacker receives a burst of direct energy damage equal to 100% of the Defender's Attack. If either of these are triggered, the Pressure Gauge value is reset to 5."
        },
        "413": {
            "node_name": "Pressure Gauge - 3",
            "node_info": "The Attacker starts the fight with a Pressure Gauge value of 5. Landing Basic Attacks increases the value by 1 for each hit. Blocking an attack, or activating a Special Attack decreases the value by 1. If the value reaches 0, the Attacker's Power is drained to 0. If the value reaches 10, the Attacker receives a burst of direct energy damage equal to 300% of the Defender's Attack. If either of these are triggered, the Pressure Gauge value is reset to 5."
        },
        "414": {
            "node_name": "Prey on the Weak",
            "node_info": "Gains power whenever an opponent's beneficial effect expires."
        },
        "415": {
            "node_name": "Prey on the Weak - 3",
            "node_info": "The Defender gains 3% of their Max Power each time a Buff is Nullified, expires, or is removed off the Attacker."
        },
        "416": {
            "node_name": "Prey on the Weak - 4",
            "node_info": "The Defender gains 5% of their Max Power each time a Buff is Nullified, expires, or is removed off the Attacker."
        },
        "417": {
            "node_name": "Prey on the Weak - 5",
            "node_info": "The Defender gains 8% of their Max Power each time a Buff is Nullified, expires, or is removed off the Attacker."
        },
        "418": {
            "node_name": "Prey on the Weak - 6",
            "node_info": "The Defender gains 12% of their Max Power each time a Buff is Nullified, expires, or is removed off the Attacker."
        },
        "419": {
            "node_name": "Professors in Crime",
            "node_info": "Instantly gain X% of his Max Power each time he Exploits a Weakness."
        },
        "420": {
            "node_name": "Protection Shielding - 1",
            "node_info": "If the Defender would lose more than 5% health from a single source, that damage is capped and Protection shield shuts down for 10 seconds."
        },
        "421": {
            "node_name": "Protection Shielding - 2",
            "node_info": "If the Defender would lose more than 4% health from a single source, that damage is capped and Protection shield shuts down for 8 seconds."
        },
        "422": {
            "node_name": "Protection Shielding - 3",
            "node_info": "If the Defender would lose more than 3% health from a single source that damage is capped and the Protection shield shuts down for 5 seconds."
        },
        "423": {
            "node_name": "Prove Yourself",
            "node_info": "The Defender is Indestructible as long as the Attacker's Combo is below X."
        },
        "424": {
            "node_name": "Psychic Thorns 1",
            "node_info": "When the Defender is struck with a Physical Contact attack the Attacker takes 5% of the Defender's Attack as Direct Damage. Striking the Defender with any Non-Contact attack heals the Attacker for 100% of the Damage dealt."
        },
        "425": {
            "node_name": "Punishment Glutton",
            "node_info": "Skill Attackers gain a permanent Passive Fury increasing Attack Rating by 10% each time a Bleed or Incinerate Debuff is Purified, or expires on the Opponent. Max stacks 20."
        },
        "426": {
            "node_name": "Quick Nullify (Regen) 1",
            "node_info": "Whenever the Attacker gains a Regeneration Buff it is Nullified after 4.5 seconds."
        },
        "427": {
            "node_name": "Rabid",
            "node_info": "After the defending Squirrel Girl uses any Special Attack, her squirrel sidekick, Tippy-Toe, attaches to the Opponent."
        },
        "428": {
            "node_name": "Rage",
            "node_info": "Damage taken in a single hit is capped at 2.50% of Max Health. When damage cap is reached, gain a Fury Buff. Upon reaching 5 Fury Buffs activated by Rage, attacks become Unblockable. Ability Accuracy modification doesn't affect this Node."
        },
        "429": {
            "node_name": "Rage of the Beast",
            "node_info": "The Defending Sasquatch builds Rage 1 seconds faster when not landing attacks."
        },
        "430": {
            "node_name": "Ragnarok",
            "node_info": "Stunning this enemy makes them Furious, while the Stuns they inflict can break even the toughest Armor."
        },
        "431": {
            "node_name": "Rainbow of Power",
            "node_info": "Doubled Power Gain triggers all the way."
        },
        "432": {
            "node_name": "Rapid Metabolism 2",
            "node_info": "This Defender shrugs off Debuffs 60% sooner."
        },
        "433": {
            "node_name": "Rapid Metabolism 3",
            "node_info": "This Defender shrugs off Debuffs 80% sooner."
        },
        "434": {
            "node_name": "Raptor Upgrades",
            "node_info": "Upgrades to Darkhawk's Raptor Armor enable him to start the fight in Null Mode. Additionally, while in Null Mode, Darkhawk's Light and Medium Attacks are Unblockable."
        },
        "435": {
            "node_name": "Reborn!",
            "node_info": "Luke's soul still has some kick, providing Indestructibility every X Combo hits."
        },
        "436": {
            "node_name": "Recharge",
            "node_info": "While Blocking, the Defender generates 15% Power every second. While the Attacker is Blocking, they generate 10% Power every second. Both champion's Power Rate is reduced by 100%."
        },
        "437": {
            "node_name": "Recovery 200%",
            "node_info": "Healing and Regeneration abilities recover 200% more Health."
        },
        "438": {
            "node_name": "Redoubled Determination - 1",
            "node_info": "For Each Debuff, Defender gains +35% Attack and +10% Power Gain Rate. Bleed, Poison and Armor Break Debuffs count twice for this effect."
        },
        "439": {
            "node_name": "Redoubled Determination - 2",
            "node_info": "For Each Debuff, Defender gains +50% Attack and +15% Power Gain Rate. Bleed, Poison and Armor Break Debuffs count twice for this effect."
        },
        "440": {
            "node_name": "Redoubled Determination - 3",
            "node_info": "For Each Debuff, Defender gains +65% Attack and +20% Power Gain Rate. Bleed, Poison and Armor Break Debuffs count twice for this effect."
        },
        "441": {
            "node_name": "Regeneration",
            "node_info": "Regenerates X% Health permanently."
        },
        "442": {
            "node_name": "Renewed Vigor",
            "node_info": "Each time Ronin is Stunned, he gains a Cruelty Passive."
        },
        "443": {
            "node_name": "Replicate",
            "node_info": "Special Attacks have a 90% chance to copy up to 2 effect(s)."
        },
        "444": {
            "node_name": "Reprisal",
            "node_info": "Well Timed Blocks grant the Attacker a Fury charge, increasing their Attack Rating by 6% per charge. Up to 10 charges can be gained and performing a Medium or Light Attack consumes one charge."
        },
        "445": {
            "node_name": "Resistor",
            "node_info": "When struck with an Energy or Physical Attack, activate a corresponding Resistance Buff increasing respective Resistance by 20%. When an Energy Resistance Buff is activated, remove a Physical Resistance Buff and vice-versa."
        },
        "446": {
            "node_name": "Resonance Cascade",
            "node_info": "Critical Hits increase Critical Hit Rate by X%."
        },
        "447": {
            "node_name": "Return Policy - 1",
            "node_info": "Whenever any of the Defender's Buffs are Nullified they gain 20% of a bar of Power."
        },
        "448": {
            "node_name": "Return to Sender - Bleed II",
            "node_info": "40% chance for the Defender to purify any incoming Bleed Debuffs and apply a Bleed Debuff to the Attacker dealing 20% Attack over 7 seconds. If this Bleed is purified, or prevented by the Attacker's immunities, they instead receive a Passive Degeneration dealing 50% Attack over 7 seconds."
        },
        "449": {
            "node_name": "Return to Sender - Bleed III",
            "node_info": "60% chance for the Defender to purify any incoming Bleed Debuffs and apply a Bleed Debuff to the Attacker dealing 30% Attack over 7 seconds. If this Bleed is purified, or prevented by the Attacker's immunities, they instead receive a Passive Degeneration dealing 60% Attack over 7 seconds."
        },
        "450": {
            "node_name": "Return to Sender - Incinerate II",
            "node_info": "40% chance for the Defender to purify any incoming Incinerate Debuffs and apply an Incinerate Debuff to the Attacker dealing 20% Attack over 7 seconds. If this Incinerate is purified, or prevented by the Attacker's immunities, they instead receive a Passive Degeneration dealing 50% Attack over 7 seconds."
        },
        "451": {
            "node_name": "Return to Sender - Poison II",
            "node_info": "40% chance for the Defender to purify any incoming Poison Debuffs and apply a Poison Debuff to the Attacker dealing 20% Attack over 7 seconds. If this Poison is purified, or prevented by the Attacker's immunities, they instead receive a Passive Degeneration dealing 50% Attack over 7 seconds."
        },
        "452": {
            "node_name": "Return to Sender - Shock II",
            "node_info": "40% chance for the Defender to purify any incoming Shock Debuffs and apply a Shock Debuff to the Attacker dealing 20% Attack over 7 seconds. If this Shock is purified, or prevented by the Attacker's immunities, they instead receive a Passive Degeneration dealing 50% Attack over 7 seconds."
        },
        "453": {
            "node_name": "Rich get Richer (Power) - 1",
            "node_info": "Whichever Champion has more Unique Buffs gains 5% of a bar of Power every second."
        },
        "454": {
            "node_name": "Rich get Richer (Power) - 2",
            "node_info": "Whichever Champion has more Unique Buffs gains 9% of a bar of Power every second."
        },
        "455": {
            "node_name": "Right Back At It - 1",
            "node_info": "When the Defender is knocked down by a Heavy or Special Attack they become Debuff Immune for 4 seconds."
        },
        "456": {
            "node_name": "Rise to Power - 3",
            "node_info": "When the Defender is knocked down a 4 second timer starts. While active, each time the Defender lands a hit or strikes into the block, they gain 50% of a bar of Power."
        },
        "457": {
            "node_name": "Rising Combo",
            "node_info": "Aegon's Persistent Combo increases by 10 for every 5 second(s)."
        },
        "458": {
            "node_name": "Rising Sun",
            "node_info": "When the Defender is Struck, the Attacker gains a Fury Buff granting 2.5% Attack Rating for 25 seconds. Once the Attacker has 10 Fury Buffs any additional ones will inflict them with a stacking Passive Degeneration dealing 12% of the Defender's Attack over 4 seconds. If the Attacker lands a Heavy Attack their Fury Buffs are removed."
        },
        "459": {
            "node_name": "Role Reversal",
            "node_info": "The Class Relationships on this Node are reversed."
        },
        "460": {
            "node_name": "Rolling Thunder",
            "node_info": "This enemy raises Special Attack Damage by X% for every X second(s) that pass."
        },
        "461": {
            "node_name": "Runaway Express",
            "node_info": "Attackers that are #Size: XL will throw an Unblockable attack every 10 hits on the Combo Meter."
        },
        "462": {
            "node_name": "Running On Fumes",
            "node_info": "While close to the Defender, the Attacker gains a Fatigue Debuff every 3 seconds, reducing their Critical Rating permanently. Staying far away from the Defender causes these Fatigue effects to gradually fall off."
        },
        "463": {
            "node_name": "Sadist - 1",
            "node_info": "This Defender gains +10% Attack for each Debuff on them."
        },
        "464": {
            "node_name": "Sadist - 2",
            "node_info": "This Defender gains +25% Attack for each Debuff on them."
        },
        "465": {
            "node_name": "Sadist - 3",
            "node_info": "This Defender gains +50% Attack for each Debuff on them."
        },
        "466": {
            "node_name": "Safeguard",
            "node_info": "Prevents champion from losing more than 1% Health from a single source."
        },
        "467": {
            "node_name": "Schadenfreude - 2",
            "node_info": "Each time the Attacker is inflicted with a Debuff, the Defender gains a Fury Buff granting 240% Attack Rating for 8 seconds. This Fury does not stack multiple times."
        },
        "468": {
            "node_name": "Science Ascendancy Lv.1",
            "node_info": "Science Champions receive +20% base Attack. Additionally, adjacency in the Class Wheel grants Skill Champions +10% base Attack."
        },
        "469": {
            "node_name": "Science Research",
            "node_info": "Reduces the duration of the target's Debuff effects by X% when facing a target of the Science Class."
        },
        "470": {
            "node_name": "Scientific Exploit",
            "node_info": "Science Attackers gain a permanent Passive Fury increasing Attack Rating by 10% each time a Debuff expires on the Defender. Max stacks 20."
        },
        "471": {
            "node_name": "Second Line",
            "node_info": "This War Machine is equipped with a second line of equipment for multiple Empty The Clip triggers."
        },
        "472": {
            "node_name": "Seeing Red",
            "node_info": "Mutant Attackers reduce the potency of Bleed Debuffs by 50%, additionally when activating a Special Attack they purify any Bleed Debuffs on themselves and gain a permanent Passive Prowess increasing Special Attack Damage by 20% for every Bleed Purified this way. Max stacks 20."
        },
        "473": {
            "node_name": "Selective Timestream",
            "node_info": "Every 20 second(s) the Defender's Health is instantly restored to Full and any Debuffs on them are removed, this cannot be prevented with Ability Accuracy Reduction. Incinerate and Shock Debuffs prevent this Regeneration."
        },
        "474": {
            "node_name": "Shank",
            "node_info": "When striking into the Defender's block, the Attacker has a 40% chance to be inflicted with a Bleed Debuff dealing up to 1% of the Defender's Attack as direct damage over 10 seconds."
        },
        "475": {
            "node_name": "Sharpened Claws",
            "node_info": "Slash through Blocks, inflicting 5 stacks of Bleed. Each Bleed does 10% of Attack over 3 seconds. 3 second delay before applying more stacks of Bleed."
        },
        "476": {
            "node_name": "Shatter - 1",
            "node_info": "Nullify abilities shatter their targets, dealing 1300 Direct Damage for each effect Nullified in this way."
        },
        "477": {
            "node_name": "Shifting Immunity - Bleed and Poison",
            "node_info": "The Defender starts te fight with Bleed Immunity, which alternates every 10 second(s) with Poison Immunity. When an Immunity triggers, it Purifies any corresponding effects."
        },
        "478": {
            "node_name": "Shock 30",
            "node_info": "Inflicts Shock damage on the Attacker, draining 100% Health over 30 seconds. This ability has +100% flat Ability Accuracy."
        },
        "479": {
            "node_name": "Shock 60",
            "node_info": "Inflicts Shock damage on the Attacker, draining 100% Health over 60 seconds. This ability has +100% flat Ability Accuracy."
        },
        "480": {
            "node_name": "Shock Tether - 2",
            "node_info": "If either champion has not made contact in 8 seconds both champions gain a Shock Debuff dealing 50% of their own Base Attack over 3 seconds."
        },
        "481": {
            "node_name": "Shock Tether - 3",
            "node_info": "If either champion has not made contact in 6 seconds both champions gain a Shock Debuff dealing 50% of their own Base Attack over 3 seconds."
        },
        "482": {
            "node_name": "Shockingly Brilliant",
            "node_info": "Any champion inflicted with a Shock Debuff lands guaranteed Critical Hits for the duration of the Shock Debuff."
        },
        "483": {
            "node_name": "Short Burst Lock Down - 2",
            "node_info": "Attacker begins with a Heal Block and Armor Break Debuff, lasting 10 seconds and reducing Armor Rating by 600."
        },
        "484": {
            "node_name": "Short Burst Lock Down - 3",
            "node_info": "Attacker begins with a Heal Block and Armor Break Debuff, lasting 12 seconds and reducing Armor Rating by 900."
        },
        "485": {
            "node_name": "Singularity",
            "node_info": "Crit after 5 attacks instead of 7."
        },
        "486": {
            "node_name": "Six Powers Combined",
            "node_info": "The power of ISO-8 combines to enhance Maestro's abilities with extraordinary power."
        },
        "487": {
            "node_name": "Sixth Sense",
            "node_info": "The Defender has a 50% Chance to Auto Block all Medium and Light Attacks."
        },
        "488": {
            "node_name": "Size Matters",
            "node_info": "Extra Large Champions' Attacks cannot be Glanced. Large Champions' Special Attacks, Intercepts, and Heavy Attacks cannot be Glanced. Medium Champions' Intercepts and Heavy Attacks cannot be Glanced. Small Champions' Heavy Attacks cannot be Glanced. This buff only applies to the Attacker and is exclusive to this Champion Challenge."
        },
        "489": {
            "node_name": "Skill Ascendancy Lv.3",
            "node_info": "Skill Champions receive +40% base Attack and Science Champions receive -40% base Attack penalty. Additionally, adjacency in the Class Wheel grants Mutant Champions +20% base Attack."
        },
        "490": {
            "node_name": "Skill Training",
            "node_info": "Increases Critical Resistance by X% when facing a target of the Skill Class."
        },
        "491": {
            "node_name": "Skillful Distraction",
            "node_info": "Skill Attackers prevent the Defender's Evade abilities while the Defender is suffering from a Disorient, Incinerate or Shock effect."
        },
        "492": {
            "node_name": "Slashed Tires",
            "node_info": "Dashing backwards against this enemy causes you to take 50% of their Attack as Direct Damage."
        },
        "493": {
            "node_name": "Slumber",
            "node_info": "For the first 15 seconds, the Defender is Stunned and Power Locked, after which the Defender gains a permanent Fury passive increasing Base Attack by 1000%."
        },
        "494": {
            "node_name": "Small Arms",
            "node_info": "Each consecutive Heavy Attack suffers a 50% Attack reduction. This cannot lower the Attacker's Heavy Attack Damage below 10% of its original value."
        },
        "495": {
            "node_name": "Soft Guard",
            "node_info": "Each Blocked attack reduces Block Proficiency by 2%, up to a maximum of 80% reduction."
        },
        "496": {
            "node_name": "Soul Seeker",
            "node_info": "Mephisto begins the fight with 1 extra soul."
        },
        "497": {
            "node_name": "Special 1 Bias",
            "node_info": "This defender is more likely to activate Special Attack 1."
        },
        "498": {
            "node_name": "Special 2 Bias",
            "node_info": "This defender is more likely to activate Special Attack 2."
        },
        "499": {
            "node_name": "Special 3 Bias",
            "node_info": "This defender is more likely to activate Special Attack 3."
        },
        "500": {
            "node_name": "Special Attack Heal Block",
            "node_info": "The Defender's Special Attacks inflict a Heal Block Debuff and a Passive Fate Seal against Regeneration Buffs for 10 seconds."
        },
        "501": {
            "node_name": "Special Chaos Inversion",
            "node_info": "The Attacker's Dash and Dodge controls are inverted from the start of the Defender's Special Attacks until just after they end."
        },
        "502": {
            "node_name": "Special Delivery",
            "node_info": "The Attacker begins the fight with 15 Combo charges. Each landed basic attack decreases the Combo charges by 1 and launching a Special Attack will reset the charges. If all charges are removed, they are reset and the Attacker suffers a Passive Degen equal to 100% of the Defender's Attack Rating over 4 seconds."
        },
        "503": {
            "node_name": "Special Lock 1",
            "node_info": "Attackers suffer from Power Lock after acquiring one bar of Power."
        },
        "504": {
            "node_name": "Special Lock 2",
            "node_info": "Attackers suffer from Power Lock after acquiring two bars of Power."
        },
        "505": {
            "node_name": "Specialist - 1",
            "node_info": "The Attacker's Special Attack 1 deals 50% more damage, but their other Special Attacks deal 50% less damage."
        },
        "506": {
            "node_name": "Specialist - 2",
            "node_info": "The Attacker's Special Attack 2 deals 50% more damage, but their other Special Attacks deal 50% less damage."
        },
        "507": {
            "node_name": "Spectre",
            "node_info": "A lingering ancestral curse reverses the effects of all healing abilities."
        },
        "508": {
            "node_name": "Spectre of Ailment - 2",
            "node_info": "The Attacker's Regeneration Rate is reduced by 50% for each Non-Damaging Debuff on them."
        },
        "509": {
            "node_name": "Spider-verse Heroism",
            "node_info": "The Defender gains +15% Critical Rate and +1.50 seconds of Buff Duration if they are a Hero of the Spider-verse."
        },
        "510": {
            "node_name": "Spiked Armor",
            "node_info": "Spiked armor provides further protection when struck by a Critical hit, increasing this champion's Physical Resistance by 20% for 5 seconds. Additionally, 6% Attack as Physical Damage is dealt back to the opponent."
        },
        "511": {
            "node_name": "Spirit of Justice",
            "node_info": "Ghost Rider gains +50% Judgment Ability Accuracy."
        },
        "512": {
            "node_name": "Spite",
            "node_info": "While opponents have active Buffs, this champion activates Power Flood out of Spite, granting 18% Power per second and Special Attacks have a 100% chance to be Unblockable."
        },
        "513": {
            "node_name": "Split Atom",
            "node_info": "All Champions classes but Science reduce their Attack by 50%."
        },
        "514": {
            "node_name": "Spontaneous Combustion",
            "node_info": "When Human Torch has at least 7 Smoulder Passives on himself and 20 Temperature, he enters Nova Form for 7 seconds."
        },
        "515": {
            "node_name": "Spreading Infection",
            "node_info": "Whenever the Opponent would gain one or more Virus charges, 50% chance for them to gain an additional charge."
        },
        "516": {
            "node_name": "Spry",
            "node_info": "Each time the Defender Passively Evades an attack, a Fatigue Debuff is placed on the Attacker, reducing their Critical Rating by 1000 for 15 seconds."
        },
        "517": {
            "node_name": "Stack Overflow",
            "node_info": "Each Additional Tech Champion on the Attacker's Team increases the Duration of their Debuffs by 10%."
        },
        "518": {
            "node_name": "Stacked Deck",
            "node_info": "Joe Fixit's Double Down ability becomes permanent."
        },
        "519": {
            "node_name": "Stage Fright - 1",
            "node_info": "After the Attacker uses a Special Attack, a 15 second timer is started. If the Attacker activates another Special while this timer is active they are inflicted with Passive Direct Damage dealing 25% of their current health as direct damage over 4 seconds."
        },
        "520": {
            "node_name": "Starburst",
            "node_info": "Suffer Degeneration proportionate to this Champion's missing Health."
        },
        "521": {
            "node_name": "Static Blast",
            "node_info": "An aura of electricity drains 50% of the Attacker's power whenever the Defender launches a Special Attack. Special Attacks Power Burn 100% of the Attacker's Power. Blocking the Special Attack reduces the Power Burn damage by half."
        },
        "522": {
            "node_name": "Steady Buildup - Fury",
            "node_info": "The Defender has 100% increased Defensive Ability Accuracy. When the Attacker has 3 or more Debuffs, the Defender gains a Fury Passive increasing Attack Rating by 150% until the Attacker has 0 Debuffs. Whenever the Attacker Purifies a Debuff, they gain a Fury Passive, increasing Attack Rating by 100% for 10 second(s)."
        },
        "523": {
            "node_name": "Steady Buildup - Unblockable",
            "node_info": "The Defender has 100% increased Defensive Ability Accuracy. When the Attacker has 3 or more Debuffs, the Defender becomes Unblockable until the Attacker has 0 Debuffs. Whenever the Attacker Purifies a Debuff, they become Unblockable for 7 second(s)."
        },
        "524": {
            "node_name": "Steady Perseverance - 1",
            "node_info": "When the Defender activates a Special Attack, they gain a Stun Immunity Buff for 4 second(s) plus 2 second(s) for each of the Defender's unique Buffs. This Buff is paused during the Defender's Special Attacks."
        },
        "525": {
            "node_name": "Strength in Numbers",
            "node_info": "For each Member of the Attacker's team that is knocked out, the Attacker suffers a 25% Attack and Ability Accuracy reduction"
        },
        "526": {
            "node_name": "Strike Back",
            "node_info": "When Damaged by a Special Attack, this enemy gains 1 bar of Power."
        },
        "527": {
            "node_name": "Strike Counter - Combat Power Rate",
            "node_info": "The Attacker starts with 5 Light Charge(s), 4 Medium Charges, and 2 Heavy Charges. A Charge is removed whenever the Attacker lands a Corresponding Attack, and all Charges are reset when the Attacker lands a Special Attack. When any Charge reaches 0, the Attacker's Combat Power Rate decreases over time until Charges are reset."
        },
        "528": {
            "node_name": "Strike Counter - Fury",
            "node_info": "The Attacker starts with 5 Light Charge(s), 4 Medium Charges, and 2 Heavy Charges. A Charge is removed whenever the Attacker lands a Corresponding Attack, and all Charges are reset when the Attacker lands a Special Attack. When any Charge reaches 0, the Defender gains Fury Passives over time until Charges are reset."
        },
        "529": {
            "node_name": "Stun",
            "node_info": "Defender's attacks have a X% chance to inflict a Stun Debuff for X seconds."
        },
        "530": {
            "node_name": "Stun Immunity",
            "node_info": "The Defender is immune to the effects of Stun."
        },
        "531": {
            "node_name": "Stun Vulnerability",
            "node_info": "While the Defender is Stunned, the Attacker's Attack Rating is increased by 200% when landing an attack."
        },
        "532": {
            "node_name": "Stung Once, Twice Shy - 1",
            "node_info": "When the Attacker gains a Bar of Power, they are afflicted with a Power Sting Debuff for 6 second(s)."
        },
        "533": {
            "node_name": "Stung Once, Twice Shy - 2",
            "node_info": "When the Attacker gains a Bar of Power, they are afflicted with a Power Sting Debuff for 6 second(s)."
        },
        "534": {
            "node_name": "Stung Once, Twice Shy - 3",
            "node_info": "When the Attacker gains a Bar of Power, they are afflicted with a Power Sting Debuff for 6 second(s)."
        },
        "535": {
            "node_name": "Stupefy",
            "node_info": "Increase the duration of Stun effects by 100%."
        },
        "536": {
            "node_name": "Sun's out Guns out",
            "node_info": "Every 10 seconds the Defender gains 1 stack of Flare State."
        },
        "537": {
            "node_name": "Supercharge",
            "node_info": "Every 15 seconds the Defender activates a Power Gain Buff, granting 20% of their maximum Power over 10 seconds."
        },
        "538": {
            "node_name": "Superior Specials - 1",
            "node_info": "The Defender starts the fight with an indefinite Passive Prowess increasing Special Attack damage by 50%."
        },
        "539": {
            "node_name": "Superior Specials - 2",
            "node_info": "The Defender starts the fight with an indefinite Passive Prowess increasing Special Attack damage by 100%."
        },
        "540": {
            "node_name": "Surging Vengeance",
            "node_info": "Uses Special Attacks in consecutive order from 1 to 3, restarting from the beginning after Special 3."
        },
        "541": {
            "node_name": "Tactical Adjustment",
            "node_info": "When the Attacker receives a Bleed they're immune to, Nick has a 75% chance to gain 1 Tactical Charge. This chance is reduced to 25% against Mutants."
        },
        "542": {
            "node_name": "Tank Buster",
            "node_info": "Critical Damage & Power Rate increases by up to 100% based on Attacker's Block Proficiency."
        },
        "543": {
            "node_name": "Team Building Exercise",
            "node_info": "SMASH attacks have a 50% chance to be Unblockable."
        },
        "544": {
            "node_name": "Tech Advancement",
            "node_info": "Abilities that cause Sentinel to lose Power are X% less effective when facing a target of the Tech Class."
        },
        "545": {
            "node_name": "Tech Ascendancy Lv.1",
            "node_info": "Tech Champions receive +20% base Attack. Additionally, adjacency in the Class Wheel grants Cosmic Champions +10% base Attack."
        },
        "546": {
            "node_name": "Tech Ascendancy Lv.2",
            "node_info": "Tech Champions receive +30% base Attack and Mutant Champions receive -10% base Attack penalty. Additionally, adjacency in the Class Wheel grants Cosmic Champions +15% base Attack."
        },
        "547": {
            "node_name": "Tech Wrath",
            "node_info": "All Tech Champions in this Arena receive Fury for the length of the fight, raising Attack by 125%."
        },
        "548": {
            "node_name": "Tenacity - 2",
            "node_info": "When inflicted with a Debuff, this Defender has a 50% chance to Purify the effect."
        },
        "549": {
            "node_name": "Tenacity - 3",
            "node_info": "When inflicted with a Debuff, this Defender has a 75% chance to Purify the effect."
        },
        "550": {
            "node_name": "Terminal Velocity",
            "node_info": "Every time the Defender is struck by a Critical Hit, even through a Block, they increase their defensive Power Gain Rate by X% up to a maximum of X%."
        },
        "551": {
            "node_name": "Termination Contract",
            "node_info": "Gains a 30% chance to Evade, against his current Exploit Weakness target."
        },
        "552": {
            "node_name": "The Best Defense ... 1",
            "node_info": "The Defender gains 20% Evade and Auto-Block Ability Accuracy. Triggering Evade or Auto-Block grants the Defender 10% of a Bar of Power."
        },
        "553": {
            "node_name": "The Best Defense ... 3",
            "node_info": "The Defender gains +60% Evade and Auto-Block Ability Accuracy. Triggering Evade or Auto-Block grants the Defender 30% of a Bar of Power."
        },
        "554": {
            "node_name": "The Champion Indestructible",
            "node_info": "When The Champion has at least 3 active Fury Buffs, he activates an Indestructible Buff, ignoring all incoming damage."
        },
        "555": {
            "node_name": "The Last Stick",
            "node_info": "Groot's gentle nature comes to a thrashing end after receiving exactly 100 attacks."
        },
        "556": {
            "node_name": "The Queen of Hel",
            "node_info": "X% chance to instantly regain X% Health just before being knocked out."
        },
        "557": {
            "node_name": "Thermostat",
            "node_info": "The Attacker starts the fight with a Thermostat value of 10. Landing Basic Attacks increases the value by 1 for each hit. Blocking an attack, or activating a Special Attack decreases the value by 2. If the value reaches 0, the Attacker is inflicted with Coldsnap, if the value reaches 20, the Attacker is inflicted with Incinerate. If either of these are triggered, the Thermostat value is reset to 10."
        },
        "558": {
            "node_name": "Thorns",
            "node_info": "Retaliates with X% Attack as Physical Damage whenever struck by an Attack that makes contact."
        },
        "559": {
            "node_name": "Thunderbolts",
            "node_info": "Current Exploit Weakness target becomes Unblockable."
        },
        "560": {
            "node_name": "Titan's Favor",
            "node_info": "Once per fight, after 15 seconds have passed in the fight, Cull Obsidian gains 1 Persistent Charge."
        },
        "561": {
            "node_name": "Titanic Conquest",
            "node_info": "Activating a Special Attack causes Cull Obsidian to activate his Rout Buff, if it is available."
        },
        "562": {
            "node_name": "Tough as Nails",
            "node_info": "Every 3 seconds, the Defender gains a permanent Armor Up Buff increasing Armor Rating by 20% per stack. When the Defender is struck, reset the timer for creating an Armor Up Buff. Max stacks 5."
        },
        "563": {
            "node_name": "Toxic Behavior",
            "node_info": "If Mysterio has 3 Chemical Gas for 8 seconds they are automatically converted into Poison Debuff on the Attacker."
        },
        "564": {
            "node_name": "Toxic Rage",
            "node_info": "Each time Diablo drinks a Concoction he gives himself a 0 damage Poison Debuff lasting 25 seconds and he becomes Unstoppable for 40 seconds. Each Poison effect also causes Diablo to fight more aggressively."
        },
        "565": {
            "node_name": "Toxic Splash",
            "node_info": "Activating a Special Attack allows the Defender to remove all Poison Debuffs on the attacker, dealing 65% of attack as direct damage for each Debuff removed."
        },
        "566": {
            "node_name": "Toxicant? Toxi-can!",
            "node_info": "Both the Attacker and Defender's strikes have a 20% chance to apply a Poison Debuff, dealing 50% of their attack as Direct Damage over 10 seconds and reducing recovery rate by 30%."
        },
        "567": {
            "node_name": "Tranquility - 1",
            "node_info": "Every 15 seconds, all Buffs and Debuffs are removed from both Champions and both Champions are reset to 0 Power."
        },
        "568": {
            "node_name": "Tranquility - 2",
            "node_info": "Every 20 seconds, all Buffs and Debuffs are removed from both Champions and both Champions are reset to 0 Power."
        },
        "569": {
            "node_name": "Transducer",
            "node_info": "The Defender rewards more Power when struck, but its presence drains the Attacker's Power."
        },
        "570": {
            "node_name": "Trial by Fire I",
            "node_info": "If the Defender is not struck within 6 seconds the Attacker receives an Incinerate Debuff dealing 25% of the Defender's base attack as Direct Damage over 6 seconds."
        },
        "571": {
            "node_name": "Trial by Fire II",
            "node_info": "If the Defender is not struck within 4 seconds the Attacker receives an Incinerate Debuff dealing 50% of the Defender's base attack as Direct Damage over 8 seconds."
        },
        "572": {
            "node_name": "Trial by Fire III",
            "node_info": "If the Defender is not struck within 2 seconds the Attacker receives an Incinerate Debuff dealing 100% of the Defender's base attack as Direct Damage over 10 seconds."
        },
        "573": {
            "node_name": "True Strike",
            "node_info": "Defender's attacks ignore Armor, Resistance and Evasion."
        },
        "574": {
            "node_name": "Tunnel Vision",
            "node_info": "When the Attacker performs the same action twice in a row and they do not have a Falter Debuff applied to them from this Node, they have a 100% chance to gain a Falter Debuff, which causes them to Miss their next attack. When the Attacker's strikes Miss, this Falter Debuff is removed. Special Attacks do not count as actions towards this effect."
        },
        "575": {
            "node_name": "Turn the Tide",
            "node_info": "One of the Attacker's Special Attacks is randomly chosen at the start of the fight. The chosen Special Attack rotates every 10 second(s), or when the Attacker ends a Combo with an Attack that didn't end their previous combo. The Attacker's Special Attacks suffer -100% Ability Accuracy and -90% Weakness, unless it is the chosen Special Attack."
        },
        "576": {
            "node_name": "Turtling",
            "node_info": "If the Attacker hasn't landed a hit in 6 seconds the Defender gains an indefinite Armor Up Buff, increasing their Armor Rating by 30%, with a max of 3 stacks. Landing a hit resets the timer."
        },
        "577": {
            "node_name": "Typhoon",
            "node_info": "When the Defender activates a Special Attack they place a Passive Ion Pulse Charge on the Attacker. At 10 Charge(s) the Attacker is Power Burned for 100% of their Current Power and the Charges are Removed. If the Attacker performs a Special 3 all Charges are Removed."
        },
        "578": {
            "node_name": "Tyranny",
            "node_info": "Villains in this arena attain absolute Power. Heroes do not gain Power."
        },
        "579": {
            "node_name": "Tyrant",
            "node_info": "#Villain attackers cause 50% of their Attack as bonus Energy Damage each time they Hit their Opponent or their Block, as long as the Defender suffers from a Weakness Debuff."
        },
        "580": {
            "node_name": "UNLIMITED POWER!",
            "node_info": "For each Debuff the Defender has suffered since the start of the fight, every 10 seconds they activate a permanent Fury Buff increasing their Attack by 25%. If these Fury Buffs are Nullified or removed in any way, the Defender gains 15% of their max Power for each Buff Nullified."
        },
        "581": {
            "node_name": "Unblockable",
            "node_info": "All attacks are Unblockable for the first X seconds of the fight."
        },
        "582": {
            "node_name": "Unblockable (Special Attacks)",
            "node_info": "All Special Attacks are Unblockable."
        },
        "583": {
            "node_name": "Unblockable Finale",
            "node_info": "Attacks are unblockable as long as Health remains below 25%."
        },
        "584": {
            "node_name": "Under Pressure - 1",
            "node_info": "When the Attacker dashes back, they gain a Disorient Timer for 1.2 second(s). Dashing back again while the Disorient timer is active inflicts a Disorient Debuff lowering Defensive Ability Accuracy and Block Proficiency by 50% for 5 second(s). Max 1 stack."
        },
        "585": {
            "node_name": "Under Pressure - 2",
            "node_info": "When the Attacker dashes back, they gain a Disorient Timer for 1.2 second(s). Dashing back again while the Disorient timer is active inflicts a Disorient Debuff lowering Defensive Ability Accuracy and Block Proficiency by 50% for 7 second(s). Max 1 stack."
        },
        "586": {
            "node_name": "Untamed Force",
            "node_info": "20% chance for his low-kick first Medium Attack to be Unblockable. Additionally, if the opoonent activates and Unstoppable effect as a result of this attack, it expires instantly."
        },
        "587": {
            "node_name": "Utility Belt",
            "node_info": "Night Thrasher's Special Attack 1 releases all 3 Gadget Debuffs at once and can be inflicted when Blocked."
        },
        "588": {
            "node_name": "Vexing Blight",
            "node_info": "Science Attackers gain an indefinite Passive Fury increasing Attack Rating by 20% every time they remove a Poison effect or are immune to one. Max Stacks 15."
        },
        "589": {
            "node_name": "Vigor",
            "node_info": "Every 15 seconds after the start of the fight, the Defender Regenerates 50% of Base Health over 5 seconds. The timer refreshes when the Defender reaches intervals of 25% missing Health."
        },
        "590": {
            "node_name": "Vigorous Assault",
            "node_info": "While the Defender has a Regen Buff active they gain +X% attack rating and their attacks become Unblockable."
        },
        "591": {
            "node_name": "Villainy",
            "node_info": "Villains in this arena periodically gain Cruelty, increasing Critical Damage by 250% for 7 seconds."
        },
        "592": {
            "node_name": "Vitality Rush",
            "node_info": "Whichever Champion starts the fight with a greater percentage of their total Health gains a percent Attack bonus equal to the difference between their Health Percentage, and their Opponent's."
        },
        "593": {
            "node_name": "Vivified - I",
            "node_info": "This Defender has 100% Defensive Combat Power Rate, and cannot be affected by Powe Drain, Power Steal, or Power Burn abilities."
        },
        "594": {
            "node_name": "WARNING",
            "node_info": "A third Special Attack has been activated!"
        },
        "595": {
            "node_name": "Weak in the Knees",
            "node_info": "The Attacker is inflicted with a permanent Passive Weakness reducing their Attack Rating by 50%. This Weakness is removed while the Defender is suffering from a Non-Damaging Debuff."
        },
        "596": {
            "node_name": "Well of Souls",
            "node_info": "Guillotine's Soul Charges never expire and new Souls join her cause throughout the fight."
        },
        "597": {
            "node_name": "What's Yours is Mine",
            "node_info": "Whenever the Defender has a Weakness Debuff applied to them, a Fury Buff with X% of the Weakness' potency is given to the Attacker for X seconds. While the Attacker does not have a Fury Buff from this effect, the Attacker deals X% less damage to the Defender."
        },
        "598": {
            "node_name": "While They're Down - 1",
            "node_info": "Each time the Attacker is inflicted with a Non-Damaging Debuff, the Defender gains a Fury Buff granting 120% Attack Rating for 6 seconds. This Fury effect does not stack multiple times."
        },
        "599": {
            "node_name": "Will of Khonshu",
            "node_info": "All of Moon Knight's passive abilities are activated, regardless of the current lunar phase."
        },
        "600": {
            "node_name": "Window of Opportunity - Stun",
            "node_info": "The Defender starts the fight Stun Immune. Whenever they would be Stunned, the Attacker is instead Stunned for 4 second(s). The Immunity lasts for 12 second(s), then goes on cooldown for 12 second(s) before returning. When the Immunity returns, it Purifies all Stun Debuffs on the Defender."
        },
        "601": {
            "node_name": "Worldmind Connection",
            "node_info": "When struck by a Heavy Hit Nova gains 25 Nova Charges."
        },
        "602": {
            "node_name": "Worldmind Surge",
            "node_info": "Whenever Nova's Power is Drained, Locked, Burned, or Stolen, generate 25 Nova Charges."
        },
        "603": {
            "node_name": "X-Gene",
            "node_info": "All Champion classes but Mutant reduce their Base Attack by 50%."
        },
        "604": {
            "node_name": "Ebb And Flow - HEAVY",
            "node_info": "The Defender has Protection, reducing all incoming damage by 60%. Hitting the Defender with a Heavy Attack removes the Protection and grants the Attacker a Cruelty Passive, increasing Critical Damage Rating by 30% for 12 second(s). When the Cruelty expires, the Protection returns, and all Debuffs on the Defender are Purified."
        },
        "605": {
            "node_name": "Ebb And Flow - INTERCEPT",
            "node_info": "The Defender has Protection, reducing all incoming damage by 60%. Intercepting the Defender removes the Protection and grants the Attacker a Fury Passive, increasing Attack Rating by 40% for 12 second(s). When the Fury expires, the Protection returns, and all Debuffs on the Defender are Purified."
        },
        "606": {
            "node_name": "Ebb And Flow - KNOCK DOWN",
            "node_info": "The Defender has Protection, reducing all incoming damage by 60%. Knocking down the Defender removes the Protection and grants the Attacker a Fury Passive, increasing Attack Rating by 40% for 12 second(s). When the Fury expires, the Protection returns, and all Debuffs on the Defender are Purified."
        },
        "607": {
            "node_name": "COMBAT DÉJÀ VU - PROWESS",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row, the Defender gains a Prowess Buff, increasing Special Attack Damage by 50% for 10 seconds."
        },
        "608": {
            "node_name": "COMBAT DÉJÀ VU - UNBLOCKABLE",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row, the Defender gains an Unblockable Buff for 6 seconds."
        },
        "609": {
            "node_name": "COMBAT DÉJÀ VU - WEAKNESS",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row they are inflicted with a Weakness Debuff, reducing Attack Rating by 30% for 12 seconds."
        },
        "610": {
            "node_name": "Prowess Puncture - 3",
            "node_info": "Each time the Defender gains Prowess they also gain a non-stacking Passive Impact charge, granting 60% Block Penetration for 5 seconds."
        },
        "611": {
            "node_name": "Static Defense - 3",
            "node_info": "If the Attacker strikes the opponent with an active Armor Up Buff, there is 15% chance for the player to be afflicted with a shock debuff, dealing 50% of Modified Attack in Direct Damage over 10 seconds."
        },
        "612": {
            "node_name": "Return Policy - 3",
            "node_info": "Whenever any of the Defenders Buffs are Nullified they gain 60% of a bar of Power."
        },
        "613": {
            "node_name": "Return Policy - 5",
            "node_info": "Whenever any of the Defenders Buffs are Nullified they gain 100% of a bar of Power."
        },
        "614": {
            "node_name": "Hazard Shift - Shock, Bleed",
            "node_info": "Striking the Defender has a 40% chance to inflict the Attacker with a Shock Debuff, dealing 30% Attack Damage over 7 second(s). Every 12 second(s), this is swapped for a chance to inflict Bleed instead."
        },
        "615": {
            "node_name": "Hazard Shift - Incinerate, Poison",
            "node_info": "Striking the Defender has a 40% chance to inflict the Attacker with an Incinerate Debuff, dealing 30% Attack Damage over 7 second(s). Every 12 second(s), this is swapped for a chance to inflict Poison instead."
        },
        "616": {
            "node_name": "Insult To Injury - 2",
            "node_info": "Each Debuff on the Attacker reduces their Defensive Ability Accuracy by -15%."
        },
        "617": {
            "node_name": "Insult To Injury - 3",
            "node_info": "Each Debuff on the Attacker reduces their Defensive Ability Accuracy by -30%."
        },
        "618": {
            "node_name": "Bubble Shield - 2",
            "node_info": "Each time the Attacker Blocks an attack, their Block Proficiency reduces by 4%. After 10 stacks, the Defender's next attack is Unblockable."
        },
        "619": {
            "node_name": "Bubble Shield - 3",
            "node_info": "Each time the Attacker Blocks an attack, their Block Proficiency reduces by 6%. After 10 stacks, the Defender's next attack is Unblockable."
        },
        "620": {
            "node_name": "Defective Defense",
            "node_info": "Blocking attacks has a 100% chance to apply a Disorient Debuff to the Attacker, reducing Block Proficiency and Defensive Ability Accuracy by 25% for 12 second(s). The chance is reduced by 50% flat if the Block was Well-Timed. The Attacker can dash back and hold block for 1.2 second(s) to remove one of these Debuffs."
        },
        "621": {
            "node_name": "Special Burst Lockdown - 1",
            "node_info": "Whenever the Defender activates a Special Attack, the Attacker is afflicted with both a Heal Block and an Armor Break Debuff, lasting 5 seconds and reducing Armor Rating by 30%."
        },
        "622": {
            "node_name": "Special Burst Lockdown - 2",
            "node_info": "Whenever the Defender activates a Special Attack, the Attacker is afflicted with both a Heal Block and an Armor Break Debuff, lasting 10 seconds and reducing Armor Rating by 35%."
        },
        "623": {
            "node_name": "Special Burst Lockdown - 3",
            "node_info": "Whenever the Defender activates a Special Attack, the Attacker is afflicted with both a Heal Block and an Armor Break Debuff, lasting 15 seconds and reducing Armor Rating by 40%."
        },
        "624": {
            "node_name": "Prowess Build Up - Unblockable",
            "node_info": "If the Defender has 3 Prowess Buffs or Passives, all their Specials are Passively Unblockable until the Prowesses are removed."
        },
        "625": {
            "node_name": "Under Pressure - 3",
            "node_info": "When the Attacker dashes back, they gain a Disorient Timer for 1.20 second(s). Dashing back again while the Disorient Timer is active inflicts a Disorient Debuff lowering Defensive Ability Accuracy and Block Proficiency by 50% for 9 second(s). Max 1 stack."
        },
        "626": {
            "node_name": "Strike Counter - Block Penetration",
            "node_info": "The Attacker starts with 5 Light Charge(s), 4 Medium Charges, and 2 Heavy Charges. A Charge is removed whenever the Attacker lands a Corresponding Attack, and all Charges are reset when the Attacker lands a Special Attack. When any Charge reaches 0, the Defender gains Passive 15% Block Penetration repeatedly over time until Charges are reset."
        },
        "627": {
            "node_name": "Passively Special - 3",
            "node_info": "After the Defender throws a Special Attack, they gain +1 Passive Prowess for each hit that was blocked. If the Attacker performs a Well-Timed block they gain this Prowess for themself instead. Each Prowess increases Special Attack Damage by 30% and lasts until the end of the next Special Attack that makes contact."
        },
        "628": {
            "node_name": "Hard Knock Life - 4",
            "node_info": "Every time the Attacker performs a successful Well Timed Block, they gain a Passive Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 20% for 15 seconds."
        },
        "629": {
            "node_name": "Rise to Power - 1",
            "node_info": "When the Defender is knocked down a 4 second timer starts. While active, each time the Defender lands a hit or strikes into the block, they gain 15% of a bar of Power."
        },
        "630": {
            "node_name": "Rise to Power - 2",
            "node_info": "When the Defender is knocked down a 4 second timer starts. While active, each time the Defender lands a hit or strikes into the block, they gain 30% of a bar of Power."
        },
        "631": {
            "node_name": "Rich get Richer (Power) - 3",
            "node_info": "Whichever Champion has more Unique Buffs gains 12% of a bar of Power every second."
        },
        "632": {
            "node_name": "Nerves of Steel - 2",
            "node_info": "Every 8 second(s) the Defender gains an indefinite Armor Up Passive, increasing Armor Rating by 15%. Max stacks 10. Striking the Defender's Block removes an Armor Up."
        },
        "633": {
            "node_name": "Nerves of Steel - 3",
            "node_info": "Every 6 second(s) the Defender gains an indefinite Armor Up Passive, increasing Armor Rating by 15%. Max stacks 10. Striking the Defender's Block removes an Armor Up."
        },
        "634": {
            "node_name": "Return Policy - 2",
            "node_info": "Whenever any of the Defenders Buffs are Nullified they gain 40% of a bar of Power."
        },
        "635": {
            "node_name": "Conflictor - 3",
            "node_info": "Every 7 seconds the next Debuff is activated on the Defender is immediately purified. Each time this Triggers, the Defender gains 70% of a bar of power."
        },
        "636": {
            "node_name": "Conflictor - 4",
            "node_info": "Every 7 seconds the next Debuff is activated on the Defender is immediately purified. Each time this Triggers, the Defender gains 100% of a bar of power."
        },
        "637": {
            "node_name": "Stunning Reflection",
            "node_info": "At the start of the fight, the Defender receives a permanent Stun shield, while this shield is active the Defender can't be stunned. Every time a Stun is attempted, the Attacker is stunned instead for 3 seconds. The shield will go into a cooldown for 8 seconds if the Defender is inflicted with either Poison or Incinerate. While this cooldown is active, the Attacker gains +40% Attack Rating."
        },
        "638": {
            "node_name": "Prowess Puncture - 2",
            "node_info": "Each time the Defender gains Prowess they also gain a non-stacking Passive Impact charge, granting 40% Block Penetration for 5 seconds."
        },
        "639": {
            "node_name": "Armor - 1",
            "node_info": "+20% Armor"
        },
        "640": {
            "node_name": "Armor - 2",
            "node_info": "+45% Armor"
        },
        "641": {
            "node_name": "Armor - 3",
            "node_info": "+66% Armor"
        },
        "642": {
            "node_name": "Armor - 4",
            "node_info": "+90% Armor"
        },
        "643": {
            "node_name": "Mystic Ward - 2",
            "node_info": "Enemy Nullify effects have a 80% chance to fail."
        },
        "644": {
            "node_name": "Mystic Ward - 3",
            "node_info": "Enemy Nullify effects have a 95% chance to fail."
        },
        "645": {
            "node_name": "Boost Buff (Armor Up) 3",
            "node_info": "The Defender's Armor Up Buffs gain +75% duration and Ability Accuracy. When struck with a Critical Hit, the Defender will remove 1 Armor Up Buff to reduce the damage to 0."
        },
        "646": {
            "node_name": "Limber 10%",
            "node_info": "Each time the Defender receives a Stun Debuff, they reduce the Duration of further Stun Debuffs by 10%."
        },
        "647": {
            "node_name": "Hard Knock Life - 1",
            "node_info": "Every time the Attacker performs a successful Well Timed Block, they gain a Passive Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 5% for 15 seconds."
        },
        "648": {
            "node_name": "Buffet - 1",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender will Regenerate 5% of their Max Health."
        },
        "649": {
            "node_name": "Buffet - 2",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender will Regenerate 10% of their Max Health."
        },
        "650": {
            "node_name": "Super-Buffet 2",
            "node_info": "Every 5 seconds the next Precision, Armor Up, Fury, Power Flood, Regen, Cruelty, Resist Physical, Unstoppable, or Unblockable Buff triggered by the Attacker is immediately Nullified and applied to the Defender. Each time this effect triggers, the Defender will Regenerate 10% of their Max Health. Intercepting the Defender refreshes the cooldown and increases future cooldown timers by 1 second(s)."
        },
        "651": {
            "node_name": "Recovery 150%",
            "node_info": "Healing and Regeneration abilities recover 150% more Health."
        },
        "652": {
            "node_name": "Recovery 100%",
            "node_info": "Healing and Regeneration abilities recover 100% more Health."
        },
        "653": {
            "node_name": "Recovery 50%",
            "node_info": "Healing and Regeneration abilities recover 50% more Health."
        },
        "654": {
            "node_name": "Physical Resistance 40%",
            "node_info": "+40% Physical Resistance"
        },
        "655": {
            "node_name": "Physical Resistance 60%",
            "node_info": "+60% Physical Resistance"
        },
        "656": {
            "node_name": "Physical Resistance 80%",
            "node_info": "+80% Physical Resistance"
        },
        "657": {
            "node_name": "Physical Resistance 90%",
            "node_info": "+90% Physical Resistance"
        },
        "658": {
            "node_name": "Physical Resistance 10%",
            "node_info": "+10% Physical Resistance"
        },
        "659": {
            "node_name": "Energy Resistance 20%",
            "node_info": "+20% Energy Resistance"
        },
        "660": {
            "node_name": "Energy Resistance 40%",
            "node_info": "+40% Energy Resistance"
        },
        "661": {
            "node_name": "Energy Resistance 60%",
            "node_info": "+60% Energy Resistance"
        },
        "662": {
            "node_name": "Energy Resistance 90%",
            "node_info": "+90% Energy Resistance"
        },
        "663": {
            "node_name": "Tranquility - 3",
            "node_info": "Every 25 seconds, all Buffs and Debuffs are removed from both Champions and both Champions are reset to 0 Power."
        },
        "664": {
            "node_name": "Improved Power Gain 50%",
            "node_info": "Increases all Power this Defender receives from Power Gain Effects by 50%."
        },
        "665": {
            "node_name": "Improved Power Gain 200%",
            "node_info": "Increases all Power this Defender receives from Power Gain Effects by 200%."
        },
        "666": {
            "node_name": "Prowess Puncture - 1",
            "node_info": "Each time the Defender gains Prowess they also gain a non-stacking Passive Impact charge, granting 20% Block Penetration for 5 seconds."
        },
        "667": {
            "node_name": "Ionized Armor - 2",
            "node_info": "When the Defender finishes a Special Attack, they gain an indefinite Armor Up Buff granting +10% Armor."
        },
        "668": {
            "node_name": "Static Defense - 1",
            "node_info": "If the Attacker strikes the opponent with an active Armor Up Buff, there is 15% chance for the player to be afflicted with a shock debuff, dealing 5% of Modified Attack in Direct Damage over 10 seconds."
        },
        "669": {
            "node_name": "Static Defense - 2",
            "node_info": "If the Attacker strikes the opponent with an active Armor Up Buff, there is 15% chance for the player to be afflicted with a shock debuff, dealing 20% of Modified Attack in Direct Damage over 10 seconds."
        },
        "670": {
            "node_name": "Passively Special - 1",
            "node_info": "After the Defender throws a Special Attack, they gain +1 Passive Prowess for each hit that was blocked. If the Attacker performs a Well-Timed block they gain this Prowess for themself instead. Each Prowess increases Special Attack Damage by 10% and lasts until the end of the next Special Attack that makes contact."
        },
        "671": {
            "node_name": "Nerves of Steel - 1",
            "node_info": "Every 10 second(s) the Defender gains an indefinite Armor Up Passive, increasing Armor Rating by 15%. Max stacks 10. Striking the Defender's Block removes an Armor Up."
        },
        "672": {
            "node_name": "Right Back At It - 2",
            "node_info": "When the Defender is knocked down by a Heavy or Special Attack they become Debuff Immune for 6 seconds."
        },
        "673": {
            "node_name": "Insult To Injury - 1",
            "node_info": "Each Debuff on the Attacker reduces their Defensive Ability Accuracy by -10%."
        },
        "674": {
            "node_name": "Backup Recovery - 2",
            "node_info": "When brought below 50% Health the Defender gains a burst of 25% Power. If a reduction to Ability Accuracy prevents this, the defender instead recovers 20% Max Health."
        },
        "675": {
            "node_name": "Passively Special - 2",
            "node_info": "After the Defender throws a Special Attack, they gain +1 Passive Prowess for each hit that was blocked. If the Attacker performs a Well-Timed block they gain this Prowess for themself instead. Each Prowess increases Special Attack Damage by 20% and lasts until the end of the next Special Attack that makes contact."
        },
        "676": {
            "node_name": "The Best Defense ... 2",
            "node_info": "The Defender gains +40% Evade and Auto-Block Ability Accuracy. Triggering Evade or Auto-Block grants the Defender 20% of a Bar of Power."
        },
        "677": {
            "node_name": "Missing in Action 2",
            "node_info": "Whenever a Buff on the Defender expires, if the Attacker lands a Heavy or Special Attack within 4 seconds the Defender is Faltered for 4 seconds, otherwise, the Attacker is. Faltered Champions have 100% chance for their attacks to miss."
        },
        "678": {
            "node_name": "Electric Defense - 2",
            "node_info": "Each time the Defender is Struck while under the effect of an Armor Up Buff they will Power Burn the Attacker for 10% of a Bar of Power. Power Burn Damage scales with each Armor Up Buff, as well as the Defender's Base Attack."
        },
        "679": {
            "node_name": "Electric Defense - 3",
            "node_info": "Each time the Defender is Struck while under the effect of an Armor Up Buff they will Power Burn the Attacker for 18% of a Bar of Power. Power Burn Damage scales with each Armor Up Buff, as well as the Defender's Base Attack."
        },
        "680": {
            "node_name": "Spaced Armor - 3",
            "node_info": "While the Defender has an active Armor Up Buff, they are immune to the effects of Nullify, Fate Seal, and Stagger. While an Armor up Buff is Active striking the Defender will Special Lock the Attacker for 6 seconds."
        },
        "681": {
            "node_name": "Stalwart Shield",
            "node_info": "Each Armor Up Buff on the Defender reduces the Duration of Debuffs on them by 15%."
        },
        "682": {
            "node_name": "Stunning Immunity - 3",
            "node_info": "When the Attacker triggers an Immunity, the Defender becomes Stun Immune for 8 seconds. Max 1 Stack."
        },
        "683": {
            "node_name": "True Focus",
            "node_info": "Defender's attacks ignore Evade and Miss."
        },
        "684": {
            "node_name": "Second Wind (Damage Reflection) - 3",
            "node_info": "Whenever the Defender Purifies or Cleanses a Debuff, they gain an Damage Reflection Passive for 8 seconds dealing back 50% of the damage dealt by the Attacker."
        },
        "685": {
            "node_name": "Second Wind (Unblockable) - 3",
            "node_info": "Whenever the Defender Purifies or Cleanses a Debuff, they gain an Unblockable Charge. If the Defender reaches 3 Unblockable Charges, they gain an Unblockable Passive for 8 seconds."
        },
        "686": {
            "node_name": "Power Creep - 3",
            "node_info": "Each time the Defender Purifies or Cleanses a Debuff, they gain a Charge that permanently increases their Combat Power Rate by 7%. This goes up to a maximum of 20 Charges."
        },
        "687": {
            "node_name": "Winded - 3",
            "node_info": "Each time the Defender is knocked down, the Defender suffers an Armor Break Debuff, decreasing their Armor Rating by 50 for 7 seconds."
        },
        "688": {
            "node_name": "Standing in Fear",
            "node_info": "While close to the Defender, the Defender gains a Fatigue Debuff every 3 seconds, reducing their Critical Rating permanently. Staying far away from the Defender causes these Fatigue effects to gradually fall off."
        },
        "689": {
            "node_name": "Broken Measures",
            "node_info": "Each time the Attacker inflicts an Armor Break or Shatter Debuff, they gain an Aptitude Buff increasing Fury, Armor Up and Precision buffs by 10% for 10 seconds. While under the effect of this Aptitude, the Attacker gains 5% of a Bar of Power each second."
        },
        "690": {
            "node_name": "Preventative Measures",
            "node_info": "Each time a Fate Seal, Stagger, or Neutralize effect is applied to the Defender, the Attacker steals 3% of a bar of Power from the Opponent. Whenever the Defender's Buffs are Nullified via Fate Seal or Stagger or fail to trigger due to Neutralize, the Attacker gains a non-stacking Flourish Passive, increasing Combat Power Rate and Ability Power Rate by 10% for 10 seconds."
        },
        "691": {
            "node_name": "Critical Measures",
            "node_info": "While the Attacker has any Precision effect active, they Passively gain True Accuracy, ignoring Evade and Auto-Block effects. While the Attacker has any True Accuracy effect active, their Damaging Debuffs have a 20% increased potency."
        },
        "692": {
            "node_name": "Hurtful Measures",
            "node_info": "When an Exhaustion, Fatigue, or Petrify Debuff is applied to the Defender, also apply a Non-Stacking 20% Potency Taunt Debuff, lasting 10 seconds. While the Defender is under the effect of 3 or more Non-Damaging Debuffs, the Attacker gains a Fury Passive, granting a 20% Attack Rating."
        },
        "693": {
            "node_name": "Defensive Measures",
            "node_info": "While Blocking, the Attacker gains Block Proficiency based on 50% of their Current Armor Rating. While the Attacker has at least one Armor Up Buff, performing a Well-Timed Block Power Burns the Defender for 15% of a Bar of Power, dealing Direct Damage proportionate to the amount of Power lost."
        },
        "694": {
            "node_name": "Prowed Measures",
            "node_info": "While under the effect of a Regen, Basic Attacks have a 35% Chance to grant a 20% Passive Prowess, Max: 10. These Prowesses are removed after Special Attacks. Activating a Special Attack while under the effect of any Prowess effect inflicts the Defender with a non-stacking 50% potency Concussion Passive for 8 seconds."
        },
        "695": {
            "node_name": "Dawn of Protection",
            "node_info": "The Defender gains Indefinite Protection Passives every 14 seconds reducing Damage by 30%. Remove one Protection Passive from the Defender when they are struck by a Medium Combo Ender, the final hit of a Heavy Attack, or final hit of a Special Attack. After a Protection Passive has been removed by one of these Attacks they cannot be removed again until reset. Attack actions are reset after completing each one once."
        },
        "696": {
            "node_name": "Dawn of Intensity",
            "node_info": "The Defender gains Indefinite Fury Passives every 10 seconds increasing Damage by 50%. Remove one Fury Passive from the Defender when they are struck for the first time by a Medium Combo Ender, the final hit of a Heavy Attack, or final hit of a Special Attack. After a Fury Passive has been removed by one of these Attacks they cannot be removed again until reset. Attack actions are reset after completing each one once."
        },
        "697": {
            "node_name": "Piercing Pursuit",
            "node_info": "When the Attacker Dashes backward the Defender gains a 10% Pierce Passive, Max: 5. Intercepting the Defender removes all Pierces gained by this ability."
        },
        "698": {
            "node_name": "Special Interference",
            "node_info": "If the Attacker uses the same Special Attack as was last used by the Defender they deal 50% less damage and the Defender becomes Passively Stun Immune for 8 seconds."
        },
        "699": {
            "node_name": "Demigod Essence",
            "node_info": "Every 14 seconds the Defender gains an Unblockable Passive for 7 seconds. Striking the Defender or hitting into their Block while they don't have Unblockable pauses the cooldown timer for 1 second. This cooldown timer is also paused during the Defender's Special Attacks. This ability is unaffected by Ability Accuracy."
        },
        "700": {
            "node_name": "Keeping Pace - 3",
            "node_info": "Whenever the Defender activates any Special Attack, they pause their Buffs for 5 second(s)."
        },
        "701": {
            "node_name": "Enhanced Parry - 50% Power Gain",
            "node_info": "After a successful Parry by the Attacker, the Attacker receives a Power Gain Buff, granting 50% of a Bar of Power over 5 seconds. Does not stack."
        },
        "702": {
            "node_name": "Specialist - 3",
            "node_info": "The Attacker's Special Attack 3 deals 50% more damage, but their other Special Attacks deal 50% less damage."
        },
        "703": {
            "node_name": "Long Distance Eternity",
            "node_info": "While far away, the Defender's Fury, Unblockable, True Damage, and Power Gain Buffs are paused."
        },
        "704": {
            "node_name": "Power Through Sickness - 2",
            "node_info": "Each time the Attacker is inflicted with any Debuff, the Defender gains a Power Gain Passive granting 10% of Max Power over 8 seconds. This Power Gain does not stack multiple times."
        },
        "705": {
            "node_name": "Power Through Sickness - 1",
            "node_info": "Each time the Attacker is inflicted with any Debuff, the Defender gains a Power Gain Passive granting 5% of Max Power over 8 seconds. This Power Gain does not stack multiple times."
        },
        "706": {
            "node_name": "Debilitating Refund - 1",
            "node_info": "The Defender's Special Attacks cost 50% less power while the Attacker is suffering from any Debuff."
        },
        "707": {
            "node_name": "Diversion",
            "node_info": "Every 15 second(s), the Attacker is inflicted with a Falter Passive, causing all their attacks to Miss for 8 second(s). If the Attacker is out of striking range when this timer expires, the Defender is instead afflicted with a Falter Passive for 4 second(s)."
        },
        "708": {
            "node_name": "Vital Strikes - 2",
            "node_info": "When the Defender strikes the Attacker's Block, the Defender regenerates 500% of damage dealt."
        },
        "709": {
            "node_name": "Bob and Weave - 3",
            "node_info": "All of the Defender's Attacks are Guaranteed Critical Hits. This is disabled for 6 second(s) if the Attacker Dodges or Intercepts the Defender. The Defender can land Critical Hits through Block."
        },
        "710": {
            "node_name": "No Hit-M...ercy - 2",
            "node_info": "Each time the Defender is knocked down they gain a Cruelty Passive granting +350% Critical Damage lasting for 7 seconds. While the Defender has a Cruelty effect, they can strike with Critical Hits even while the Opponent is blocking."
        },
        "711": {
            "node_name": "Parry Vulnerability",
            "node_info": "Each time the Attacker lands a successful Parry they gain a Fury Buff, increasing Attack Rating by 75% for 15 seconds. Additionally, the Attacker gains +200% Attack Rating while the Defender is Stunned by Parry."
        },
        "712": {
            "node_name": "Reinvigorated (Unblockable) - 3",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Unblockable for 10 seconds."
        },
        "713": {
            "node_name": "Hale and Hearty - 2",
            "node_info": "Whenever the Attacker gains a Bar of Power, the Defender gains a Regeneration Buff healing 6% of their max Health over 8 seconds. This Regeneration Buff is removed early if the Defender is knocked down with a Heavy Attack."
        },
        "714": {
            "node_name": "Compelled Duel - Special Attacks",
            "node_info": "When the Defender activates their Special 1 or Special 2 within striking distance of a Basic Attack, the Attacker is passively Rooted until the final hit of the attack."
        },
        "715": {
            "node_name": "Offensive Specialty - 3",
            "node_info": "Each Dodged hit during a Special Attack grants the Attacker a Passive Prowess granting 20% increased Special Damage for 10 seconds. While under the effect of a Prowess the Attacker’s Block Proficiency is reduced by 30% per stack."
        },
        "716": {
            "node_name": "While They're Down - 2",
            "node_info": "Each time the Attacker is inflicted with a Non-Damaging Debuff, the Defender gains a Fury Buff granting 240% Attack Rating for 8 seconds. This Fury effect does not stack multiple times."
        },
        "717": {
            "node_name": "While They're Down - 2",
            "node_info": "Each time the Attacker is inflicted with a Non-Damaging Debuff, the Defender gains a Fury Buff granting 480% Attack Rating for 8 seconds. This Fury effect does not stack multiple times."
        },
        "718": {
            "node_name": "Right Back At It - 3",
            "node_info": "When the Defender is knocked down by a Heavy or Special Attack they become Debuff Immune for 8 seconds."
        },
        "719": {
            "node_name": "Reinvigorated (Unblockable) - 2",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Unblockable for 7 seconds."
        },
        "720": {
            "node_name": "Reinvigorated (Fury) - 2",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Fury granting +100% Attack for 7 seconds."
        },
        "721": {
            "node_name": "Reinvigorated (Fury) - 3",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Fury granting +100% Attack for 10 seconds."
        },
        "722": {
            "node_name": "Personal Space - Regeneration",
            "node_info": "While the Attacker is close to the Defender, the Defender gains a Regeneration Buff every 3 seconds, increasing their regeneration by 0.25% of their Max Health each second. Staying far away from the Defender causes these Regeneration effects to gradually fall off."
        },
        "723": {
            "node_name": "Drip Feed - Placebo - 3",
            "node_info": "The Attacker gains a 6 second Placebo Buff every 5 seconds. Whenever the Defender is inflicted with a non-Damaging Debuff, except for Stun, resets this Timer."
        },
        "724": {
            "node_name": "Combat Deja Vu - Placebo - 3",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row, the Attacker gains a 5 Second Placebo Buff."
        },
        "725": {
            "node_name": "Personal Space - Placebo",
            "node_info": "While the Attacker is close to the Defender, the Attacker gains a 5 second duration Placebo Buff every 3 seconds. Staying far away from the Defender causes these Placebo Buffs to gradually fall off."
        },
        "726": {
            "node_name": "Roll With The Punches",
            "node_info": "Each time the Defender receives a Stun Debuff, they reduce the duration of further Stun Debuffs by 20% unless the Attacker has an active Buff or Prowess Passive when the Stun Debuff is inflicted."
        },
        "727": {
            "node_name": "Shatter - 2",
            "node_info": "Each time the Attacker has an effect Nullified they receive a burst of Direct Damage equal to 30% of the Defender's Modified Attack Rating. Armor Break Debuffs Nullify Armor Up Buffs."
        },
        "728": {
            "node_name": "Shatter - 3",
            "node_info": "Each time the Attacker has an effect Nullified they receive a burst of Direct Damage equal to 50% of the Defender's Modified Attack Rating. Armor Break Debuffs Nullify Armor Up Buffs."
        },
        "729": {
            "node_name": "Spaced Armor - 1",
            "node_info": "While the Defender has an active Armor Up Buff, they are immune to the effects of Nullify, Fate Seal, and Stagger. While an Armor up Buff is Active striking the Defender will Special Lock the Attacker for 2 seconds."
        },
        "730": {
            "node_name": "Spaced Armor - 2",
            "node_info": "While the Defender has an active Armor Up Buff, they are immune to the effects of Nullify, Fate Seal, and Stagger. While an Armor up Buff is Active striking the Defender will Special Lock the Attacker for 5 seconds."
        },
        "731": {
            "node_name": "Rich get Richer (Fury) - 3",
            "node_info": "Whichever Champion has more Unique Buffs gains a stacking Passive Fury every 1 second(s), each increasing Attack rating by 15%."
        },
        "732": {
            "node_name": "Rich Get Richer (Fury) - 2",
            "node_info": "Whichever Champion has more Unique Buffs gains a stacking Passive Fury every 1 second(s), each increasing Attack rating by 10%."
        },
        "733": {
            "node_name": "Masochism Over Time - 1",
            "node_info": "Whenever the Defender is inflicted with a Debuff, it is immediately Purified and the Defender gains a Regeneration Buff, granting 5% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "734": {
            "node_name": "Masochism Over Time - 2",
            "node_info": "Whenever the Defender is inflicted with a Debuff, it is immediately Purified and the Defender gains a Regeneration Buff, granting 10% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "735": {
            "node_name": "Masochism Over Time - 3",
            "node_info": "Whenever the Defender is inflicted with a Debuff, it is immediately Purified and the Defender gains a Regeneration Buff, granting 15% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "736": {
            "node_name": "Hazard Shift - Incinerate, Shock",
            "node_info": "Striking the Defender has a 40% chance to inflict the Attacker with a Incinerate Debuff, dealing 30% Attack Damage over 7 second(s). Every 12 second(s), this is swapped for a chance to inflict Shock instead."
        },
        "737": {
            "node_name": "Scared Stiff - 1",
            "node_info": "Every 10 seconds the Attacker is Rooted for 4 seconds. Rooted Champions cannot move, but can still attack, block and dodge. Activating a Special Attack removes Root and prevents it from applying. This Timer is paused while the Attacker is Rooted and is reset if the Attacker lands a hit."
        },
        "738": {
            "node_name": "Scared Stiff - 2",
            "node_info": "Every 8 seconds the Attacker is Rooted for 4 seconds. Rooted Champions cannot move, but can still attack, block and dodge. Activating a Special Attack removes Root and prevents it from applying. This Timer is paused while the Attacker is Rooted and is reset if the Attacker lands a hit."
        },
        "739": {
            "node_name": "Scared Stiff - 3",
            "node_info": "Every 6 seconds the Attacker is Rooted for 4 seconds. Rooted Champions cannot move, but can still attack, block and dodge. Activating a Special Attack removes Root and prevents it from applying. This Timer is paused while the Attacker is Rooted and is reset if the Attacker lands a hit."
        },
        "740": {
            "node_name": "Sloped Armor - 3",
            "node_info": "Each Armor Up Buff gives the Defender a 30% Chance to Glance incoming Attacks."
        },
        "741": {
            "node_name": "Sloped Armor - 2",
            "node_info": "Each Armor Up Buff gives the Defender a 15% Chance to Glance incoming Attacks."
        },
        "742": {
            "node_name": "Buffet Over Time - 3",
            "node_info": "Whenever the Attacker triggers a Buff, it is immediately Nullified and the Defender gains a Regeneration Buff, granting 15% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "743": {
            "node_name": "Buffet Over Time - 2",
            "node_info": "Whenever the Attacker triggers a Buff, it is immediately Nullified and the Defender gains a Regeneration Buff, granting 10% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "744": {
            "node_name": "Buffet Over Time - 1",
            "node_info": "Whenever the Attacker triggers a Buff, it is immediately Nullified and the Defender gains a Regeneration Buff, granting 5% of their Max Health over 7 seconds. This Ability has a 7 second cooldown."
        },
        "745": {
            "node_name": "One Too Many Hits - 1",
            "node_info": "When the Defender gains a Bar of Power, the Attacker is inflicted with a Power Sting Debuff for 4 seconds. Power Sting triggers and is removed if the Attacker activates a Special Attack, dealing direct damage equal to 50% of the Defender's Attack."
        },
        "746": {
            "node_name": "Never Back Down - 1",
            "node_info": "When the Attacker dashes back, they gain a Regeneration Timer for 1.20 second(s). Dashing back again while the Regeneration Timer is active grants the Defender a Regeneration Passive restoring 5% of their Max Health over 5 seconds. Max 1 stack."
        },
        "747": {
            "node_name": "Never Back Down - 3",
            "node_info": "When the Attacker dashes back, they gain a Regeneration Timer for 1.20 second(s). Dashing back again while the Regeneration Timer is active grants the Defender a Regeneration Passive restoring 10% of their Max Health over 5 seconds. Max 1 stack."
        },
        "748": {
            "node_name": "Never Back Down - 2",
            "node_info": "When the Attacker dashes back, they gain a Regeneration Timer for 1.20 second(s). Dashing back again while the Regeneration Timer is active grants the Defender a Regeneration Passive restoring 7.50% of their Max Health over 5 seconds. Max 1 stack."
        },
        "749": {
            "node_name": "Subterfuge - Block",
            "node_info": "Each time the Attacker performs a Well-Timed block they gain a Fury Buff, increasing Attack Rating by 5% for 10 seconds."
        },
        "750": {
            "node_name": "Subterfuge - Special",
            "node_info": "When the Attacker throws a Special Attack they gain 1 Fury Buff for each full Bar of Power they had, each granting 5% Attack Rating for 10 seconds."
        },
        "751": {
            "node_name": "Power Creep - 1",
            "node_info": "Each time the Defender Purifies or Cleanses a Debuff, they gain a Charge that permanently increases their Combat Power Rate by 3%. This goes up to a maximum of 20 Charges."
        },
        "752": {
            "node_name": "Power Creep - 2",
            "node_info": "Each time the Defender Purifies or Cleanses a Debuff, they gain a Charge that permanently increases their Combat Power Rate by 5%. This goes up to a maximum of 20 Charges."
        },
        "753": {
            "node_name": "Enhanced Parry - Armor Up",
            "node_info": "After a successful Parry by the Attacker, the Attacker gains an Armor Up Buff, granting +1000 Armor Rating for 15 seconds. Does not stack."
        },
        "754": {
            "node_name": "Make A Stand - 2",
            "node_info": "The Defender has indefinite Protection, reducing all damage received by 75%. This goes onto cooldown for 15 seconds when knocked down."
        },
        "755": {
            "node_name": "Schadenfreude - 3",
            "node_info": "Each time the Attacker is inflicted with a Debuff, the Defender gains a Fury Buff granting 480% Attack Rating for 8 seconds. This Fury does not stack multiple times."
        },
        "756": {
            "node_name": "Power Snack - 3",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender gains 75% of a bar of Power."
        },
        "757": {
            "node_name": "Power Snack - 4",
            "node_info": "Every 7 seconds the next Buff triggered by the Attacker is immediately Nullified. Each time this effect triggers, the Defender gains 100% of a bar of Power."
        },
        "758": {
            "node_name": "Superior Specials - 3",
            "node_info": "The Defender starts the fight with an indefinite Passive Prowess increasing Special Attack damage by 200%."
        },
        "759": {
            "node_name": "Enhanced Bleed - 80%",
            "node_info": "Bleed abilities are 80% more effective."
        },
        "760": {
            "node_name": "Underhanded Comment - 1",
            "node_info": "For each Buff on the Defender, the Attacker has their Defensive Ability Accuracy reduced by 10%."
        },
        "761": {
            "node_name": "Underhanded Comment - 2",
            "node_info": "For each Buff on the Defender, the Attacker has their Defensive Ability Accuracy reduced by 20%."
        },
        "762": {
            "node_name": "Underhanded Comment - 3",
            "node_info": "For each Buff on the Defender, the Attacker has their Defensive Ability Accuracy reduced by 30%."
        },
        "763": {
            "node_name": "Special Fate Seal Lock Down - 2",
            "node_info": "Whenever the Defender activates a Special Attack, the Attacker is afflicted with both a Heal Block and a Fate Seal Debuff, each lasting 10 seconds."
        },
        "764": {
            "node_name": "Second Wind (Unblockable) - 2",
            "node_info": "Whenever the Defender Purifies or Cleanses a Debuff, they gain an Unblockable Charge. If the Defender reaches 4 Unblockable Charges, they gain an Unblockable Passive for 6 seconds."
        },
        "765": {
            "node_name": "Second Wind (Damage Reflection) - 2",
            "node_info": "Whenever the Defender Purifies or Cleanses a Debuff, they gain an Damage Reflection Passive for 6 seconds dealing back 25% of the damage dealt by the Attacker."
        },
        "766": {
            "node_name": "Winded - 1",
            "node_info": "Each time the Defender is knocked down, the Defender suffers an Armor Break Debuff, decreasing their Armor Rating by 50 for 3 seconds."
        },
        "767": {
            "node_name": "Winded - 2",
            "node_info": "Each time the Defender is knocked down, the Defender suffers an Armor Break Debuff, decreasing their Armor Rating by 50 for 5 seconds."
        },
        "768": {
            "node_name": "Drip Feed - Placebo - 2",
            "node_info": "The Attacker gains a 6 second Placebo Buff every 10 seconds. Whenever the Defender is inflicted with a non-Damaging Debuff, except for Stun, resets this Timer."
        },
        "769": {
            "node_name": "Electric Defense - 1",
            "node_info": "Each time the Defender is Struck while under the effect of an Armor Up Buff they will Power Burn the Attacker for 5% of a Bar of Power. Power Burn Damage scales with each Armor Up Buff, as well as the Defender's Base Attack."
        },
        "770": {
            "node_name": "Combat Deja Vu - Placebo - 2",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row, the Attacker gains a 8 Second Placebo Buff."
        },
        "771": {
            "node_name": "Sloped Armor - 1",
            "node_info": "Each Armor Up Buff gives the Defender a 10% Chance to Glance incoming Attacks."
        },
        "772": {
            "node_name": "Blood in the Water - 3",
            "node_info": "While the Attacker is suffering from a Debuff, the Defender gains a Passive Fury granting +200% Attack Rating lasting until all Debuffs on the Attacker expire."
        },
        "773": {
            "node_name": "Muscle Wizard",
            "node_info": "Whenever a Mystic Attacker knocks down the Defender, the Attacker has a 100% chance to gain an Unstoppable Buff for 6 second(s). If the Attacker was already Unstoppable, they instead gain an indefinite Fury Buff, increasing Attack Rating by 50%. A maximum of 4 Fury Buffs can be gained this way."
        },
        "774": {
            "node_name": "Rage 1",
            "node_info": "Damage taken in a single hit is capped at 1% of Max Health. When damage cap is reached, gain a Fury Buff. Upon reaching 5 Fury Buffs activated by Rage, attacks become Unblockable. Ability Accuracy modification doesn't affect this Node."
        },
        "775": {
            "node_name": "Arms Race",
            "node_info": "Both the Attacker and Defender gain a Passive Fury during their Special Attacks based on the Defender's Power. While below 1 Bar of Power, they gain +25% Attack. While between 1 and 2 Bars of Power, they gain +75% Attack. While above 2 Bars of Power, they gain +200% Attack."
        },
        "776": {
            "node_name": "Catatonic - 1",
            "node_info": "Whenever the Attacker is inflicted with a Root Effect they are also inflicted with a Passive Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 50% for 6 seconds."
        },
        "777": {
            "node_name": "Root or Rooted",
            "node_info": "Every 12 seconds, the Attacker gets passively rooted for 5 seconds. If the Attacker is far away from the Defender when this triggers, the Defender gets passively rooted instead. The timer will only restart after the root caused by this buff has expired."
        },
        "778": {
            "node_name": "Hot and Bothered - 3",
            "node_info": "Reduces Attacker's Def AA by 80% while they have an Incinerate debuff."
        },
        "779": {
            "node_name": "High Energy Diet",
            "node_info": "The Defender has 99% Energy Resistance, and any Hit that deals Energy Damage Regenerates them for what the damage would have been. While the Defender is affected by an Incinerate, Shock, or Coldsnap Debuff, the Defender gains 100% of a Bar of Power every 10 second(s)."
        },
        "780": {
            "node_name": "Snowballing (Fury) - 3",
            "node_info": "If the Defender is under the effect of 3 or more Buffs, they gain a Fury Passive that grant 25% attack rating every 2 seconds. Each Fury Passive lasts 15 seconds. The Defender will continue to gain these passives until all Buffs expire or are Nullified."
        },
        "781": {
            "node_name": "Inevitable Power (Power Efficiency) - 3",
            "node_info": "For each Buff the Defender has gained, they receive a Power Charge. Upon hitting 6 charges, they gain a Power Efficiency Passive for 12 seconds. During this time, all Buffs on the Defender cannot be Nullified or Staggered."
        },
        "782": {
            "node_name": "No Hit-Mercy (Passive) - 2",
            "node_info": "Whenever the defender is knocked down, they gain a Cruelty passive increasing Critical Damage rating by 350 for 7 seconds. While this timer Is on, the defender can strike Critical hits through the block."
        },
        "783": {
            "node_name": "No Hit-Mercy (Buff) - 2",
            "node_info": "Whenever the defender is knocked down, they gain a Cruelty Buff increasing Critical Damage rating by 350 for 7 seconds. While this timer Is on, the defender can strike Critical hits through the block."
        },
        "784": {
            "node_name": "Inevitable Power (Power Efficiency) - 1",
            "node_info": "For each Buff the Defender has gained, they receive a Power Charge. Upon hitting 8 charges, they gain a Power Efficiency Passive for 7 seconds. During this time, all Buffs on the Defender cannot be Nullified or Staggered."
        },
        "785": {
            "node_name": "Make A Stand - 1",
            "node_info": "The Defender has indefinite Protection, reducing all damage received by 50%. This goes onto cooldown for 15 seconds when knocked down."
        },
        "786": {
            "node_name": "Second Wind (Unblockable) - 1",
            "node_info": "Whenever the Defender Purifies or Cleanses a Debuff, they gain an Unblockable Charge. If the Defender reaches 5 Unblockable Charges, they gain an Unblockable Passive for 4 seconds."
        },
        "787": {
            "node_name": "Reinvigorated (Unblockable) - 1",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Unblockable for 5 seconds."
        },
        "788": {
            "node_name": "Reinvigorated (Fury) - 1",
            "node_info": "Every time a Regeneration Buff or Passive is activated, if the Defender is not Heal Blocked they gain a dormant Vigor Charge. Once the Defender reaches 10 Vigor Charges they're consumed and the Defender gains a Passive Fury granting +100% Attack for 5 seconds."
        },
        "789": {
            "node_name": "Drip Feed - Placebo - 1",
            "node_info": "The Attacker gains a 6 second Placebo Buff every 15 seconds. Whenever the Defender is inflicted with a non-Damaging Debuff, except for Stun, resets this Timer."
        },
        "790": {
            "node_name": "Combat Deja Vu - Placebo - 1",
            "node_info": "Whenever the Attacker lands the same type of Basic Attack twice in a row, the Attacker gains a 12 Second Placebo Buff."
        },
        "791": {
            "node_name": "Subterfuge - Knockdown",
            "node_info": "Each time the Defender is kocked down, the Attacker gains a Fury Buff, increasing Attack Rating by 5% for 10 seconds."
        }
    }
}